sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.c
/*!
    \file    gd32a7xx_rcu.c
    \brief   RCU driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_rcu.h"

/* define startup timeout count */
#define OSC_STARTUP_TIMEOUT         ((uint32_t)0x000FFFFFU)
#define LXTAL_STARTUP_TIMEOUT       ((uint32_t)0x03FFFFFFU)

/* RCU IRC48M adjust value mask and offset*/
#define RCU_IRC48M_ADJUST_MASK       ((uint8_t)0x1FU)
#define RCU_IRC48M_ADJUST_OFFSET     ((uint32_t)3U)

/*!
    \brief      deinitialize the RCU (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_deinit(void)
{
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    while((RCU_CFG0 & RCU_CFG0_SCSS) != RCU_SCSS_IRC48M) {
    }
    /* reset CTL register */
    RCU_CTL &= ~(RCU_CTL_PLLEN | RCU_CTL_CKMEN | RCU_CTL_HXTALEN | RCU_CTL_HXTALSCAL);
    RCU_CTL &= ~RCU_CTL_HXTALBPS;
    /* reset CFG0 register */
    RCU_CFG0 = 0x00202400U;
    /* reset INT and CFG1 and CFG2 register */
    RCU_INT = 0x00000000U;
    RCU_CFG1 = 0x00000000U;
    RCU_CFG2 = 0x00000000U;
    RCU_CFG3 = 0x00000000U;
    RCU_PLLFRA = 0x00000000U;
    RCU_PLLFRA = 0x00000000U;
    RCU_PLLSSCTL = 0x00000000U;
    /* reset RCTL register */
    RCU_SYSRSTSTAT |= 0x60041759U;
    RCU_BUSCTL = 0x00000000U;
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    RCU_SUBSERSTAT = 0xE0110EDFU;
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */   
#if defined (GD32A711X_A712X)   
    RCU_SUBSERSTAT = 0xE011065DU;
#endif /* defined(GD32A711X_A712X) */
    RCU_SUBSRPACTL = 0x00000000U;
    RCU_SUBSRMUCNT = 0xFU;
    RCU_SYSRSTUCNT = 0xFU;
    RCU_SUBSRMUTH = 0xFU;
    RCU_SYSMRUTH = 0xFU;
    RCU_SUBSRTO = 0x00000001U;
    RCU_AHBRST = 0x00000000U;
    RCU_APB1RST = 0x00000000U;
    RCU_APB2RST = 0x00000000U;
    RCU_APB2RST_ADD = 0x00000000U;
    RCU_PORSTAT0 = 0xFFFFFFFFU;
    RCU_PORSTAT1 = 0xFFFFFFFFU;
    RCU_PORSTAT2 = 0xFFFFFFFFU;
    RCU_PORSTAT3 = 0xFFFFFFFFU;
}

/*!
    \brief      enable the peripherals clock (API_ID(0x0002U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg    RCU_GPIOA: GPIOA clock
      \arg    RCU_GPIOB: GPIOB clock
      \arg    RCU_GPIOC: GPIOC clock
      \arg    RCU_GPIOD: GPIOD clock
      \arg    RCU_GPIOE: GPIOE clock
      \arg    RCU_GPIOF: GPIOF clock
      \arg    RCU_GPIOG: GPIOG clock
      \arg    RCU_GPIOH: GPIOH clock
      \arg    RCU_GPIOI: GPIOI clock
      \arg    RCU_GPIOJ: GPIOJ clock
      \arg    RCU_GPIOK: GPIOK clock
      \arg    RCU_GPIOL: GPIOL clock
      \arg    RCU_GPIOM: GPIOM clock
      \arg    RCU_GPION: GPION clock
      \arg    RCU_DMA0: DMA0 clock
      \arg    RCU_DMA1: DMA1 clock
      \arg    RCU_DMAMUX: DMAMUX clock
      \arg    RCU_QSPI: QSPI clock
      \arg    RCU_CRC: CRC clock
      \arg    RCU_MFCOM: MFCOM clock (not for GD32A711X_A712X)
      \arg    RCU_MCMUA: MUA clock (not for GD32A711X_A712X)
      \arg    RCU_MCMUB: MUB clock (not for GD32A711X_A712X)
      \arg    RCU_HWSEM: HWSEM clock (not for GD32A711X_A712X)
      \arg    RCU_HSMIF: HSMIF clock
      \arg    RCU_FMU: FMU clock
      \arg    RCU_IRM: IRM clock
      \arg    RCU_IOC: IOC clock (not for GD32A711X_A712X)
      \arg    RCU_STCM: STCM clock
      \arg    RCU_MTC: MTC clock
      \arg    RCU_SYSCFG: SYSCFG clock
      \arg    RCU_LINFLEXD0: LINFlexD0 clock
      \arg    RCU_LINFLEXD1: LINFlexD1 clock
      \arg    RCU_LINFLEXD2: LINFlexD2 clock
      \arg    RCU_LINFLEXD3: LINFlexD3 clock
      \arg    RCU_LINFLEXD4: LINFlexD4 clock
      \arg    RCU_LINFLEXD5: LINFlexD5 clock
      \arg    RCU_TRIGSEL: TRIGSEL clock
      \arg    RCU_ADC0: ADC0 clock
      \arg    RCU_ADC1: ADC1 clock
      \arg    RCU_TIMER0:TIMER0 clock
      \arg    RCU_SPI0: SPI0 clock
      \arg    RCU_TIMER7: TIMER7 clock
      \arg    RCU_SPI4: SPI4 clock
      \arg    RCU_SPI5: SPI5 clock
      \arg    RCU_ADC2: ADC2 clock (not for GD32A711X_A712X)
      \arg    RCU_TIMER19: TIMER19 clock
      \arg    RCU_TIMER1: TIMER1 clock
      \arg    RCU_TIMER5: TIMER5 clock
      \arg    RCU_TIMER62: TIMER62 clock
      \arg    RCU_CMP1: CMP1 clock
      \arg    RCU_SPI1: SPI1 clock
      \arg    RCU_CMP0: CMP0 clock
      \arg    RCU_TIMER20: TIMER20 clock
      \arg    RCU_TIMER2: TIMER2 clock
      \arg    RCU_TIMER60: TIMER60 clock
      \arg    RCU_TIMER6: TIMER6 clock
      \arg    RCU_WWDGT0: WWDGT0 clock
      \arg    RCU_FWDGT0: FWDGT0 clock
      \arg    RCU_SPI6: SPI6 clock (not for GD32A711X_A712X)
      \arg    RCU_SPI7: SPI7 clock (not for GD32A711X_A712X)
      \arg    RCU_I2C0: I2C0 clock
      \arg    RCU_I2C1: I2C1 clock
      \arg    RCU_BKP: BKP clock
      \arg    RCU_PMU: PMU clock
      \arg    RCU_DAC0: DAC clock
      \arg    RCU_ENET: ENET clock (not for GD32A711X_A712X)
      \arg    RCU_TIMER61:   ENET clock
      \arg    RCU_TIMER63:   TIMER63 clock
      \arg    RCU_SENT: SENT clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD6: RCU_LINFlexD6 clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD7: RCU_LINFlexD7 clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD8: RCU_LINFlexD8 clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD9: RCU_LINFlexD9 clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD10: RCU_LINFlexD10 clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD11: RCU_LINFlexD11 clock (not for GD32A711X_A712X)
      \arg    RCU_DAC1: DAC1 clock
      \arg    RCU_WWDGT1:WWDGT1 clock (not for GD32A711X_A712X)
      \arg    RCU_FWDGT1:FWDGT1 clock (not for GD32A711X_A712X)
      \arg    RCU_SPI2: SPI2 clock
      \arg    RCU_SPI3: SPI3 clock
      \arg    RCU_CLTCFG: CLTCFG clock
      \arg    RCU_RTC: RTC clock
      \arg    RCU_DTM_CAN0: DTM_CAN0 clock
      \arg    RCU_DTM_CAN1: DTM_CAN1 clock
      \arg    RCU_DTM_CAN2: DTM_CAN2 clock
      \arg    RCU_DTM_CAN3: DTM_CAN3 clock
      \arg    RCU_DTM_CAN4: DTM_CAN4 clock
      \arg    RCU_DTM_CAN5: DTM_CAN5 clock
      \arg    RCU_DTM_CAN6: DTM_CAN6 clock
      \arg    RCU_DTM_CAN7: DTM_CAN7 clock 
      \arg    RCU_CM7_0: CM7_0 clock
      \arg    RCU_CM7_1: CM7_1 clock (not for GD32A711X_A712X / GD32A714X)
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_enable(rcu_periph_enum periph)
{
    RCU_CCTL_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock (API_ID(0x0003U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg    RCU_GPIOA: GPIOA clock
      \arg    RCU_GPIOB: GPIOB clock
      \arg    RCU_GPIOC: GPIOC clock
      \arg    RCU_GPIOD: GPIOD clock
      \arg    RCU_GPIOE: GPIOE clock
      \arg    RCU_GPIOF: GPIOF clock
      \arg    RCU_GPIOG: GPIOG clock
      \arg    RCU_GPIOH: GPIOH clock
      \arg    RCU_GPIOI: GPIOI clock
      \arg    RCU_GPIOJ: GPIOJ clock
      \arg    RCU_GPIOK: GPIOK clock
      \arg    RCU_GPIOL: GPIOL clock
      \arg    RCU_GPIOM: GPIOM clock
      \arg    RCU_GPION: GPION clock
      \arg    RCU_DMA0: DMA0 clock
      \arg    RCU_DMA1: DMA1 clock
      \arg    RCU_DMAMUX: DMAMUX clock
      \arg    RCU_QSPI: QSPI clock
      \arg    RCU_CRC: CRC clock
      \arg    RCU_MFCOM: MFCOM clock (not for GD32A711X_A712X)
      \arg    RCU_MCMUA: MCMUA clock (not for GD32A711X_A712X)
      \arg    RCU_MCMUB: MCMUB clock (not for GD32A711X_A712X)
      \arg    RCU_HWSEM: HWSEM clock (not for GD32A711X_A712X)
      \arg    RCU_HSMIF: HSMIF clock
      \arg    RCU_FMU: FMU clock
      \arg    RCU_IRM: IRM clock
      \arg    RCU_IOC: IOC clock (not for GD32A711X_A712X)
      \arg    RCU_STCM: STCM clock
      \arg    RCU_MTC: MTC clock
      \arg    RCU_SYSCFG: SYSCFG clock
      \arg    RCU_LINFLEXD0: LINFlexD0 clock
      \arg    RCU_LINFLEXD1: LINFlexD1 clock
      \arg    RCU_LINFLEXD2: LINFlexD2 clock
      \arg    RCU_LINFLEXD3: LINFlexD3 clock
      \arg    RCU_LINFLEXD4: LINFlexD4 clock
      \arg    RCU_LINFLEXD5: LINFlexD5 clock
      \arg    RCU_TRIGSEL: TRIGSEL clock
      \arg    RCU_ADC0: ADC0 clock
      \arg    RCU_ADC1: ADC1 clock
      \arg    RCU_TIMER0:TIMER0 clock
      \arg    RCU_SPI0: SPI0 clock
      \arg    RCU_TIMER7: TIMER7 clock
      \arg    RCU_SPI4: SPI4 clock
      \arg    RCU_SPI5: SPI5 clock
      \arg    RCU_ADC2: ADC2 clock (not for GD32A711X_A712X)
      \arg    RCU_TIMER19: TIMER19 clock
      \arg    RCU_TIMER1: TIMER1 clock
      \arg    RCU_TIMER5: TIMER5 clock
      \arg    RCU_TIMER62: TIMER62 clock
      \arg    RCU_CMP1: CMP1 clock
      \arg    RCU_SPI1: SPI1 clock
      \arg    RCU_CMP0: CMP0 clock
      \arg    RCU_TIMER20: TIMER20 clock
      \arg    RCU_TIMER2: TIMER2 clock
      \arg    RCU_TIMER60: TIMER60 clock
      \arg    RCU_TIMER6: TIMER6 clock
      \arg    RCU_WWDGT0: WWDGT0 clock
      \arg    RCU_FWDGT0: FWDGT0 clock
      \arg    RCU_SPI6: SPI6 clock (not for GD32A711X_A712X)
      \arg    RCU_SPI7: SPI7 clock (not for GD32A711X_A712X)
      \arg    RCU_I2C0: I2C0 clock
      \arg    RCU_I2C1: I2C1 clock
      \arg    RCU_BKP: BKP clock
      \arg    RCU_PMU: PMU clock
      \arg    RCU_DAC0: DAC clock
      \arg    RCU_ENET: ENET clock (not for GD32A711X_A712X)
      \arg    RCU_TIMER61:   ENET clock
      \arg    RCU_TIMER63:   TIMER63 clock
      \arg    RCU_LINFLEXD6: LIN6 clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD7: LIN7 clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD8: LIN8 clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD9: LIN9 clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD10: LIN10 clock (not for GD32A711X_A712X)
      \arg    RCU_LINFLEXD11: LIN11 clock (not for GD32A711X_A712X)
      \arg    RCU_DAC1: DAC1 clock
      \arg    RCU_WWDGT1:WWDGT1 clock (not for GD32A711X_A712X)
      \arg    RCU_FWDGT1:FWDGT1 clock (not for GD32A711X_A712X)
      \arg    RCU_SPI2: SPI2 clock
      \arg    RCU_SPI3: SPI3 clock
      \arg    RCU_CLTCFG: CLTCFG clock
      \arg    RCU_RTC: RTC clock
      \arg    RCU_DTM_CAN0: DTM_CAN0 clock
      \arg    RCU_DTM_CAN1: DTM_CAN1 clock
      \arg    RCU_DTM_CAN2: DTM_CAN2 clock
      \arg    RCU_DTM_CAN3: DTM_CAN3 clock
      \arg    RCU_DTM_CAN4: DTM_CAN4 clock
      \arg    RCU_DTM_CAN5: DTM_CAN5 clock
      \arg    RCU_DTM_CAN6: DTM_CAN6 clock
      \arg    RCU_DTM_CAN7: DTM_CAN7 clock
      \arg    RCU_CM7_0: CM7_0 clock
      \arg    RCU_CM7_1: CM7_1 clock (not for GD32A711X_A712X / GD32A714X)
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_disable(rcu_periph_enum periph)
{
    RCU_CCTL_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      reset the peripherals (API_ID(0x0004U))
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg    RCU_GPIOARST: GPIOA reset
      \arg    RCU_GPIOBRST: GPIOB reset
      \arg    RCU_GPIOCRST: GPIOC reset
      \arg    RCU_GPIODRST: GPIOD reset
      \arg    RCU_GPIOERST: GPIOE reset
      \arg    RCU_GPIOFRST: GPIOF reset
      \arg    RCU_GPIOGRST: GPIOG reset
      \arg    RCU_GPIOHRST: GPIOH reset
      \arg    RCU_GPIOIRST: GPIOI reset
      \arg    RCU_GPIOJRST: GPIOJ reset
      \arg    RCU_GPIOKRST: GPIOK reset
      \arg    RCU_GPIOLRST: GPIOL reset
      \arg    RCU_GPIOMRST: GPIOM reset
      \arg    RCU_GPIONRST: GPION reset
      \arg    RCU_DMA0RST: DMA0 reset
      \arg    RCU_DMA1RST: DMA1 reset
      \arg    RCU_DMAMUXRST: DMAMUX reset
      \arg    RCU_QSPIRST: QSPI reset
      \arg    RCU_CRCRST: CRC reset
      \arg    RCU_MFCOMRST: MFCOM reset (not for GD32A711X_A712X)
      \arg    RCU_MCMUARST: MCMUA reset (not for GD32A711X_A712X)
      \arg    RCU_MCMUBRST: MCMUB reset (not for GD32A711X_A712X)
      \arg    RCU_HWSEMRST: HWSEM reset (not for GD32A711X_A712X)
      \arg    RCU_HSMIFRST: HSMIF reset
      \arg    RCU_IRMRST: IRM reset
      \arg    RCU_IOCRST: IOC reset (not for GD32A711X_A712X)
      \arg    RCU_STCMRST: STCM reset
      \arg    RCU_MTCRST: MTC reset
      \arg    RCU_SYSCFGRST: SYSCFG reset
      \arg    RCU_LINFLEXD0RST: LINFlexD0 reset
      \arg    RCU_LINFLEXD1RST: LINFlexD1 reset
      \arg    RCU_LINFLEXD2RST: LINFlexD2 reset
      \arg    RCU_LINFLEXD3RST: LINFlexD3 reset
      \arg    RCU_LINFLEXD4RST: LINFlexD4 reset
      \arg    RCU_LINFLEXD5RST: LINFlexD5 reset
      \arg    RCU_ADC0RST: ADC0 reset
      \arg    RCU_ADC1RST: ADC1 reset
      \arg    RCU_TIMER0RST:TIMER0 reset
      \arg    RCU_SPI0RST: SPI0 reset
      \arg    RCU_TIMER7RST: TIMER7 reset
       \arg    RCU_SPI4RST: SPI4 reset
      \arg    RCU_SPI5RST: SPI5 reset
      \arg    RCU_ADC2RST: ADC2 reset (not for GD32A711X_A712X)
      \arg    RCU_TIMER19RST: TIMER19 reset
      \arg    RCU_TIMER1RST: TIMER1 reset
      \arg    RCU_TIMER5RST: TIMER5 reset
      \arg    RCU_TIMER62RST:TIMER62 reset
      \arg    RCU_CMP1RST: CMP1 reset
      \arg    RCU_SPI1RST: SPI1 reset
      \arg    RCU_CMP0RST: CMP0 reset
      \arg    RCU_TIMER20RST: TIMER20 reset
      \arg    RCU_TIMER2RST: TIMER2 reset
      \arg    RCU_TIMER60RST: TIMER60 reset
      \arg    RCU_TIMER6RST:TIMER6 reset
      \arg    RCU_WWDGT0RST:WWDGT0 reset
      \arg    RCU_FWDGT0RST:FWDGT0 reset
      \arg    RCU_SPI6RST: SPI6 reset (not for GD32A711X_A712X)
      \arg    RCU_SPI7RST: SPI7 reset (not for GD32A711X_A712X)
      \arg    RCU_I2C0RST: I2C0 reset
      \arg    RCU_I2C1RST: I2C1 reset
      \arg    RCU_BKPRST: BKP reset
      \arg    RCU_DAC0RST: DAC0 reset
      \arg    RCU_ENETRST: ENET reset (not for GD32A711X_A712X)
      \arg    RCU_TIMER61RST: TIMER61 reset
      \arg    RCU_TIMER63RST: TIMER63 reset
      \arg    RCU_SENTRST: SENT reset (not for GD32A711X_A712X)
      \arg    RCU_LIN6RST: LIN6 reset (not for GD32A711X_A712X)
      \arg    RCU_LIN7RST: LIN7 reset (not for GD32A711X_A712X)
      \arg    RCU_LIN8RST: LIN8 reset (not for GD32A711X_A712X)
      \arg    RCU_LIN9RST: LIN9 reset (not for GD32A711X_A712X)
      \arg    RCU_LIN10RST: LIN10 reset (not for GD32A711X_A712X)
      \arg    RCU_LIN11RST: LIN11 reset (not for GD32A711X_A712X)
      \arg    RCU_DAC1RST: DAC1 reset
      \arg    RCU_WWDGT1RST:WWDGT1 reset (not for GD32A711X_A712X)
      \arg    RCU_FWDGT1RST:WWDGT1 reset (not for GD32A711X_A712X)
      \arg    RCU_SPI2RST: SPI2 reset
      \arg    RCU_SPI3RST: SPI3 reset
      \arg    RCU_CLTCFGRST: CLTCFG reset (not for GD32A711X_A712X)
      \arg    RCU_CAN0RST: CAN0 cluster reset
      \arg    RCU_CAN1RST: CAN1 cluster reset
      \arg    RCU_CAN2RST: CAN2 cluster reset
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset)
{
    RCU_RCTL_REG_VAL(periph_reset) |= BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      disable reset the peripheral (API_ID(0x0005U))
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg    RCU_GPIOARST: GPIOA reset
      \arg    RCU_GPIOBRST: GPIOB reset
      \arg    RCU_GPIOCRST: GPIOC reset
      \arg    RCU_GPIODRST: GPIOD reset
      \arg    RCU_GPIOERST: GPIOE reset
      \arg    RCU_GPIOFRST: GPIOF reset
      \arg    RCU_GPIOGRST: GPIOG reset
      \arg    RCU_GPIOHRST: GPIOH reset
      \arg    RCU_GPIOIRST: GPIOI reset
      \arg    RCU_GPIOJRST: GPIOJ reset
      \arg    RCU_GPIOKRST: GPIOK reset
      \arg    RCU_GPIOLRST: GPIOL reset
      \arg    RCU_GPIOMRST: GPIOM reset
      \arg    RCU_GPIONRST: GPION reset
      \arg    RCU_DMA0RST: DMA0 reset
      \arg    RCU_DMA1RST: DMA1 reset
      \arg    RCU_DMAMUXRST: DMAMUX reset
      \arg    RCU_QSPIRST: QSPI reset
      \arg    RCU_CRCRST: CRC reset
      \arg    RCU_MFCOMRST: MFCOM reset (not for GD32A711X_A712X)
      \arg    RCU_MCMUARST: MCMUA reset (not for GD32A711X_A712X)
      \arg    RCU_MCMUBRST: MCMUB reset (not for GD32A711X_A712X)
      \arg    RCU_HWSEMRST: HWSEM reset (not for GD32A711X_A712X)
      \arg    RCU_HSMIFRST: HSMIF reset
      \arg    RCU_IRMRST: IRM reset
      \arg    RCU_IOCRST: IOC reset (not for GD32A711X_A712X)
      \arg    RCU_STCMRST: STCM reset
      \arg    RCU_MTCRST: MTC reset
      \arg    RCU_SYSCFGRST: SYSCFG reset
      \arg    RCU_LINFLEXD0RST: LINFlexD0 reset
      \arg    RCU_LINFLEXD1RST: LINFlexD1 reset
      \arg    RCU_LINFLEXD2RST: LINFlexD2 reset
      \arg    RCU_LINFLEXD3RST: LINFlexD3 reset
      \arg    RCU_LINFLEXD4RST: LINFlexD4 reset
      \arg    RCU_LINFLEXD5RST: LINFlexD5 reset
      \arg    RCU_ADC0RST: ADC0 reset
      \arg    RCU_ADC1RST: ADC1 reset
      \arg    RCU_TIMER0RST:TIMER0 reset
      \arg    RCU_SPI0RST: SPI0 reset
      \arg    RCU_TIMER7RST: TIMER7 reset
      \arg    RCU_SPI4RST: SPI4 reset
      \arg    RCU_SPI5RST: SPI5 reset
      \arg    RCU_ADC2RST: ADC2 reset (not for GD32A711X_A712X)
      \arg    RCU_TIMER19RST: TIMER19 reset
      \arg    RCU_TIMER1RST: TIMER1 reset
      \arg    RCU_TIMER5RST: TIMER5 reset
      \arg    RCU_TIMER62RST:TIMER62 reset
      \arg    RCU_CMP1RST: CMP1 reset
      \arg    RCU_SPI1RST: SPI1 reset
      \arg    RCU_CMP0RST: CMP0 reset
      \arg    RCU_TIMER20RST: TIMER20 reset
      \arg    RCU_TIMER2RST: TIMER2 reset
      \arg    RCU_TIMER60RST: TIMER60 reset
      \arg    RCU_TIMER6RST:TIMER6 reset
      \arg    RCU_WWDGT0RST:WWDGT0 reset
      \arg    RCU_FWDGT0RST:FWDGT0 reset
      \arg    RCU_SPI6RST: SPI6 reset (not for GD32A711X_A712X)
      \arg    RCU_SPI7RST: SPI7 reset (not for GD32A711X_A712X)
      \arg    RCU_I2C0RST: I2C0 reset
      \arg    RCU_I2C1RST: I2C1 reset
      \arg    RCU_BKPRST: BKP reset
      \arg    RCU_DAC0RST: DAC0 reset
      \arg    RCU_ENETRST: ENET reset (not for GD32A711X_A712X)
      \arg    RCU_TIMER61RST: TIMER61 reset
      \arg    RCU_TIMER63RST: TIMER63 reset
      \arg    RCU_SENTRST: SENT reset (not for GD32A711X_A712X)
      \arg    RCU_LIN6RST: LIN6 reset (not for GD32A711X_A712X)
      \arg    RCU_LIN7RST: LIN7 reset (not for GD32A711X_A712X)
      \arg    RCU_LIN8RST: LIN8 reset (not for GD32A711X_A712X)
      \arg    RCU_LIN9RST: LIN9 reset (not for GD32A711X_A712X)
      \arg    RCU_LIN10RST: LIN10 reset (not for GD32A711X_A712X)
      \arg    RCU_LIN11RST: LIN11 reset (not for GD32A711X_A712X)
      \arg    RCU_DAC1RST: DAC1 reset
      \arg    RCU_WWDGT1RST:WWDGT1 reset (not for GD32A711X_A712X)
      \arg    RCU_FWDGT1RST:WWDGT1 reset (not for GD32A711X_A712X)
      \arg    RCU_SPI2RST: SPI2 reset
      \arg    RCU_SPI3RST: SPI3 reset
      \arg    RCU_CLTCFGRST: CLTCFG reset (not for GD32A711X_A712X)
      \arg    RCU_CAN0RST: CAN0 cluster reset
      \arg    RCU_CAN1RST: CAN1 cluster reset
      \arg    RCU_CAN2RST: CAN2 cluster reset
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset)
{
    RCU_RCTL_REG_VAL(periph_reset) &= ~BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      configure the system clock source (API_ID(0x0006U))
    \param[in]  ck_sys: system clock source select
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKSYSSRC_IRC48M: select CK_IRC48M as the CK_SYS source
      \arg        RCU_CKSYSSRC_HXTAL: select CK_HXTAL as the CK_SYS source
      \arg        RCU_CKSYSSRC_PLLP: select CK_PLLP as the CK_SYS source
    \param[out] none
    \retval     none
*/
void rcu_system_clock_source_config(uint32_t ck_sys)
{
    uint32_t reg;

    reg = RCU_CFG0;
    /* reset the SCS bits and set according to ck_sys */
    reg &= ~RCU_CFG0_SCS;
    RCU_CFG0 = (reg | ck_sys);

