sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.c
}

/*!
    \brief      get the system clock source (API_ID(0x0007U))
    \param[in]  none
    \param[out] none
    \retval     ck_sys: which clock is selected as CK_SYS source
      \arg        RCU_SCSS_IRC48M: CK_IRC48M is selected as the CK_SYS source
      \arg        RCU_SCSS_HXTAL: CK_HXTAL is selected as the CK_SYS source
      \arg        RCU_SCSS_PLL_P: CK_PLL_P is selected as the CK_SYS source
*/
uint32_t rcu_system_clock_source_get(void)
{
    uint32_t ck_sys = 0U;
    switch(RCU_CFG0 & RCU_CFG0_SCSS) {
    case RCU_SCSS_IRC48M:
        ck_sys = RCU_SCSS_IRC48M;
        break;
    case RCU_SCSS_HXTAL:
        ck_sys = RCU_SCSS_HXTAL;
        break;
    case RCU_SCSS_PLL_P:
        ck_sys = RCU_SCSS_PLL_P;
        break;
    default:
        break;
    }
    return ck_sys;
}

/*!
    \brief      configure the AHB clock prescaler selection (API_ID(0x0008U))
    \param[in]  ck_ahb: AHB clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_AHB_CKSYS_DIVx, x=1, 2, 4, 8, 16, 64, 128, 256, 512
    \param[out] none
    \retval     none
*/
void rcu_ahb_clock_config(uint32_t ck_ahb)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_AHB_PSC(ck_ahb)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG0;
        /* reset the AHBPSC bits and set according to ck_ahb */
        reg &= ~RCU_CFG0_AHBPSC;
        RCU_CFG0 = (reg | ck_ahb);
    }
}

/*!
    \brief      configure the APB1 clock prescaler selection (API_ID(0x0009U))
    \param[in]  ck_apb1: APB1 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB1_CKAHB_DIV1: select CK_AHB as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV2: select CK_AHB/2 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV4: select CK_AHB/4 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV8: select CK_AHB/8 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV16: select CK_AHB/16 as CK_APB1
    \param[out] none
    \retval     none
*/
void rcu_apb1_clock_config(uint32_t ck_apb1)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_APB1_PSC(ck_apb1)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG0;
        /* reset the APB1PSC and set according to ck_apb1 */
        reg &= ~RCU_CFG0_APB1PSC;
        RCU_CFG0 = (reg | ck_apb1);
    }
}

/*!
    \brief      configure the APB2 clock prescaler selection (API_ID(0x000AU))
    \param[in]  ck_apb2: APB2 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB2_CKAHB_DIV1: select CK_AHB as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV2: select CK_AHB/2 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV4: select CK_AHB/4 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV8: select CK_AHB/8 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV16: select CK_AHB/16 as CK_APB2
    \param[out] none
    \retval     none
*/
void rcu_apb2_clock_config(uint32_t ck_apb2)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_APB2_PSC(ck_apb2)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG0;
        /* reset the APB2PSC and set according to ck_apb2 */
        reg &= ~RCU_CFG0_APB2PSC;
        RCU_CFG0 = (reg | ck_apb2);
    }
}

/*!
    \brief      configure the CK_OUT clock source (API_ID(0x000BU))
    \param[in]  ckout0_src: CK_OUT clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUT0SRC_CORECK: CORECK is selected
      \arg        RCU_CKOUT0SRC_CKAPB1: CK_APB1 is selected
      \arg        RCU_CKOUT0SRC_IRC40K: IRC40K is selected
      \arg        RCU_CKOUT0SRC_LXTAL: LXTAL is selected
      \arg        RCU_CKOUT0SRC_CKSYS: CK_SYS is selected
      \arg        RCU_CKOUT0SRC_IRC48M: IRC48M is selected
      \arg        RCU_CKOUT0SRC_HXTAL: HXTAL is selected
      \arg        RCU_CKOUT0SRC_CKPLLP: CK_PLLP is selected
      \arg        RCU_CKOUT0SRC_CKPLLP_DIV2: CK_PLLP_DIV2 is selected
      \arg        RCU_CKOUT0SRC_CKAPB2: CK_APB2 is selected
      \arg        RCU_CKOUT0SRC_HSMPCLK: HSM_PCLK is selected
      \arg        RCU_CKOUT0SRC_HSMHCLK: HSM_HCLK is selected
      \arg        RCU_CKOUT0SRC_CKENETRX: CK_ENETRX is selected (not for GD32A711X_A712X)
      \arg        RCU_CKOUT0SRC_CKENETTX: CK_ENETTX is selected (not for GD32A711X_A712X)
      \arg        RCU_CKOUT0SRC_CKENETMACRMI: CK_ENETMACRMI is selected (not for GD32A711X_A712X)
      \arg        RCU_CKOUT0SRC_CKENETTS: CK_ENETTS is selected (not for GD32A711X_A712X)
    \param[in]  ckout_div: CK_OUT divider
      \arg        RCU_CKOUT0_DIVx(x=1,2,4,8,16,32,64,128): CK_OUT is divided by x
    \param[out] none
    \retval     none
*/
void rcu_ckout0_config(uint32_t ckout_src, uint32_t ckout_div)
{
    uint32_t ckout;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKOUT0SRC(ckout_src)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKOUT0_DIV(ckout_div)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ckout = RCU_CFG1;
        /* reset the CKOUTSEL and CKOUTDIV bits, and set according to ckout_src and ckout_div */
        ckout &= ~(RCU_CFG1_CKOUT0SEL | RCU_CFG1_CKOUT0DIV);
        RCU_CFG1 = (ckout | (ckout_src & BITS(16, 19)) | ckout_div);

        /* reset the PLLDV bit and set according to ckout_src */
        if(ckout_src == RCU_CKOUT0SRC_CKPLLP) {
            RCU_CFG0 |= RCU_CFG0_PLLDV;
        } else {
            RCU_CFG0 &= ~(RCU_CFG0_PLLDV);
        }
    }
}

/*!
    \brief      configure the CK_OUT1 clock source (API_ID(0x000CU))
    \param[in]  ckout1_src: CK_OUT1 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUT1SRC_IRC40K: IRC40K selected
      \arg        RCU_CKOUT1SRC_LXTAL: LXTAL selected
      \arg        RCU_CKOUT1SRC_CKAPB2: CK_APB2 clock selected
      \arg        RCU_CKOUT1SRC_IRC48M: high speed 48M internal oscillator clock selected
      \arg        RCU_CKOUT1SRC_HXTAL: HXTAL clock selected
    \param[in]  ckout1_div: CK_OUT1 divider
                only one parameter can be selected which is shown as below:    
      \arg        RCU_CKOUT1_DIVx(x=1,2,4,8,16,32,64,128): CK_OUT is divided by x
    \param[out] none
    \retval     none
*/
void rcu_ckout1_config(uint32_t ckout1_src, uint32_t ckout1_div)
{
    uint32_t ckout1;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKOUT1SRC(ckout1_src)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKOUT1_DIV(ckout1_div)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        ckout1 = RCU_CFG0;
        /* reset the CKOUT1SEL, CKOUT1DIV bits and set according to ckout_src and ckout_div */
        ckout1 &= ~(RCU_CFG0_CKOUT1SEL | RCU_CFG0_CKOUT1DIV);
        RCU_CFG0 = (ckout1 | ckout1_src | ckout1_div);
    }
}

/*!
    \brief      configure the main PLL clock (API_ID(0x000DU))
    \param[in]  pll_src: PLL clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLSRC_IRC48M: select CK_IRC48M as PLL source clock
      \arg        RCU_PLLSRC_HXTAL: select HXTAL as PLL source clock
    \param[in]  pll_predv: the PLL output frequency division factor from input clock
                only one parameter can be selected which is shown as below:
      \arg        this parameter should be selected 1,2,3,4,5,6,7
    \param[in]  pll_n: the PLL VCO clock multi factor
                only one parameter can be selected which is shown as below:
      \arg        this parameter should be selected between 16 and 255
    \param[in]  pll_pllpdiv: the PLL_P output frequency division factor from PLL VCO clock
                only one parameter can be selected which is shown as below:
      \arg        this parameter should be selected between 1 and 64
    \param[in]  pll_pllqdiv: the PLL_Q output frequency division factor from PLL VCO clock
                only one parameter can be selected which is shown as below:
      \arg        this parameter should be selected between 1 and 64
    \param[out] none
    \retval     none
*/
void rcu_pll_config(uint32_t pll_src, uint32_t pll_predv, uint32_t pll_n, uint32_t pll_pllpdiv, uint32_t pll_pllqdiv)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_PLLSRC(pll_src)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000DU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_PLL_PREDV_RANGE(pll_predv)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_RCU_PLL_N_RANGE(pll_n)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_RCU_PLLDIV_RANGE(pll_pllpdiv)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_RCU_PLLDIV_RANGE(pll_pllqdiv)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CFG1 &=  ~(RCU_CFG1_PREDV | RCU_CFG1_PLLDIVP | RCU_CFG1_PLLDIVQ);
        RCU_CFG1 |= (pll_predv | ((pll_pllpdiv - 1U) << 3U) | ((pll_pllqdiv - 1U) << 9U));
        RCU_CFG0 &= ~(RCU_CFG0_PLLMF | RCU_CFG0_PLLMF_7 | RCU_CFG0_PLLSEL);
        if(pll_n <= 0x7FU) {
            RCU_CFG0 |= (pll_src | (pll_n << 17U));
        } else {
            pll_n = pll_n & 0x7FU;
            RCU_CFG0 |= (pll_src | (pll_n << 17U) | BIT(27U));
        }
    }
}

/*!
    \brief      configure the ADC prescaler factor (API_ID(0x000EU))
    \param[in]  adc_src: ADC clock source
                only one parameter can be selected which is shown as below:
      \arg        RCU_ADCSRC_HCLK: HCLK is selected as ADC clock source
      \arg        RCU_ADCSRC_SYS: CK_SYS is selected as ADC clock source
      \arg        RCU_ADCSRC_PLLP: PLL_P is selected as ADC clock source
    \param[in]  adc_psc: ADC prescaler factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKADC_DIVx (x=2,3,...,32): ADC prescaler select CK_ADC/x
    \param[out] none
    \retval     none
*/
void rcu_adc_clock_config(uint32_t adc_src, uint32_t adc_psc)
{
    uint32_t reg;
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKADC_CKAHB_PSC(adc_psc)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_ADCSRC(adc_src)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000EU), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG2;
        reg &= ~(RCU_CFG2_ADCCLK_MUX | RCU_CFG2_ADCSEL | RCU_CFG2_ADCPSC);
        RCU_CFG2 = (reg | adc_src | adc_psc);
    }
}

/*!
    \brief      configure the SPI prescaler factor (API_ID(0x000FU))
    \param[in]  spi_src: SPI clock source
                only one parameter can be selected which is shown as below:
      \arg        RCU_SPISRC_APB1: CK_APB1 is selected as SPI clock source
      \arg        RCU_SPISRC_APB2: CK_APB2 is selected as SPI clock source
      \arg        RCU_SPISRC_IRC48M: IRC48M is selected as SPI clock source
      \arg        RCU_SPISRC_AHB: CK_AHB is selected as SPI clock source
    \param[in]  spi_div: SPI prescaler factor
                only one parameter can be selected which is shown as below:
      \arg        1,...,64: SPI prescaler
    \param[out] none
    \retval     none
*/
void rcu_spi_clock_config(uint32_t spi_src, uint32_t spi_div)
{
    uint32_t reg;
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKSPIDIV(spi_div)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000FU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_SPISRC(spi_src)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x000FU), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG3;
        reg &= ~(RCU_CFG3_SPISEL| RCU_CFG3_SPIDIV);
        RCU_CFG3 = (reg | spi_src | (spi_div - 1U) << 4U);
    }
}

/*!
    \brief      configure the RTC clock source selection (API_ID(0x0010U))
    \param[in]  rtc_clock_source: RTC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTCSRC_NONE: no clock selected
      \arg        RCU_RTCSRC_LXTAL: CK_LXTAL selected as RTC source clock
      \arg        RCU_RTCSRC_IRC40K: CK_IRC40K selected as RTC source clock
      \arg        RCU_RTCSRC_HXTAL_DIV_128: CK_HXTAL/128 selected as RTC source clock
    \param[out] none
    \retval     none
*/
void rcu_rtc_clock_config(uint32_t rtc_clock_source)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_RTCSRC(rtc_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0010U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_BDCTL;
        /* reset the RTCSRC bits and set according to rtc_clock_source */
        reg &= ~RCU_BDCTL_RTCSRC;
        RCU_BDCTL = (reg | rtc_clock_source);
    }
}

/*!
    \brief      configure the DTM_CAN clock source selection (API_ID(0x0011U))
    \param[in]  dtm_can_periph: DTM_CANx(x=0,1,..,7)(DTM_CAN6\DTM_CAN7 are not for GD32A711X_A712X)
                only one parameter can be selected.
    \param[in]  dtm_can_clock_source: DTM_CAN clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_DTM_CANSRC_HXTAL: HXTAL clock selected as DTM_CAN source clock
      \arg        RCU_DTM_CANSRC_AHB: AHB clock selected as DTM_CAN source clock
      \arg        RCU_DTM_CANSRC_PCLK2: PCLK2 clock selected as DTM_CAN source clock
      \arg        RCU_DTM_CANSRC_IRC48M: IRC48M clock selected as DTM_CAN source clock
    \param[out] none
    \retval     none
*/
void rcu_dtm_can_clock_config(uint32_t dtm_can_periph, uint32_t dtm_can_clock_source)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_DTM_CAN_PERIPH(dtm_can_periph)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    } else if(NOT_RCU_DTM_CANSRC(dtm_can_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0011U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {

        reg = RCU_CFG2;
        switch(dtm_can_periph) {
        case DTM_CAN0:
            /* reset the DTM_CAN0SEL bits and set according to dtm_can_clock_source */
            reg &= ~RCU_CFG2_DTM_CAN0SEL;
            RCU_CFG2 = (reg | (uint32_t)(dtm_can_clock_source << 8U));
            break;
        case DTM_CAN1:
            /* reset the DTM_CAN1SEL bits and set according to dtm_can_clock_source */
            reg &= ~RCU_CFG2_DTM_CAN1SEL;
            RCU_CFG2 = (reg | (uint32_t)(dtm_can_clock_source << 10U));
            break;
        case DTM_CAN2:
            /* reset the DTM_CAN1SEL bits and set according to dtm_can_clock_source */
            reg &= ~RCU_CFG2_DTM_CAN2SEL;
            RCU_CFG2 = (reg | (uint32_t)(dtm_can_clock_source << 12U));
            break;
        case DTM_CAN3:
            /* reset the DTM_CAN1SEL bits and set according to dtm_can_clock_source */
            reg &= ~RCU_CFG2_DTM_CAN3SEL;
            RCU_CFG2 = (reg | (uint32_t)(dtm_can_clock_source << 14U));
            break;
        case DTM_CAN4:
            /* reset the DTM_CAN1SEL bits and set according to dtm_can_clock_source */
            reg &= ~RCU_CFG2_DTM_CAN4SEL;
            RCU_CFG2 = (reg | (uint32_t)(dtm_can_clock_source << 16U));
            break;
        case DTM_CAN5:
            /* reset the DTM_CAN1SEL bits and set according to dtm_can_clock_source */
            reg &= ~RCU_CFG2_DTM_CAN5SEL;
            RCU_CFG2 = (reg | (uint32_t)(dtm_can_clock_source << 18U));
            break;
        case DTM_CAN6:
            /* reset the DTM_CAN1SEL bits and set according to dtm_can_clock_source */
            reg &= ~RCU_CFG2_DTM_CAN6SEL;
            RCU_CFG2 = (reg | (uint32_t)(dtm_can_clock_source << 20U));
            break;
        case DTM_CAN7:
            reg = RCU_CFG3;
            /* reset the DTM_CAN1SEL bits and set according to dtm_can_clock_source */
            reg &= ~RCU_CFG3_DTM_CAN7SEL;
            RCU_CFG3 = (reg | (uint32_t)(dtm_can_clock_source));
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure the WWDGT clock source selection (API_ID(0x0012U))
    \param[in]  wwdgt_periph: WWDGTx(x=0,1)(WWDGT1 is not applicable to GD32A711X_A712X)
    \param[in]  wwdgt_clock_source: WWDGT clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_WWDGTSRC_IRC48M: IRC48M clock selected as WWDGT source clock
      \arg        RCU_WWDGTSRC_LXTAL: LXTAL clock selected as WWDGT source clock
      \arg        RCU_WWDGTSRC_IRC40K: IRC40K clock selected as WWDGT source clock
      \arg        RCU_WWDGTSRC_HXTAL: HXTAL clock selected as WWDGT source clock
      \arg        RCU_WWDGTSRC_CKSYS: CK_SYS clock selected as WWDGT source clock
      \arg        RCU_WWDGTSRC_PCLK1: PCLK1 clock selected as WWDGT source clock
    \param[out] none
    \retval     none
*/
void rcu_wwdgt_clock_config(uint32_t wwdgt_periph, uint32_t wwdgt_clock_source)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_WWDGT_PERIPH(wwdgt_periph)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    } else if(NOT_RCU_WWDGTSRC(wwdgt_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG3;
        switch(wwdgt_periph) {
        case WWDGT0:
            /* reset the WWDGT0SEL bits and set according to wwdgt_clock_source */
            reg &= ~RCU_CFG3_WWDGT0SEL;
            RCU_CFG3 = (reg | (uint32_t)(wwdgt_clock_source));
            break;
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        case WWDGT1:
            /* reset the WWDGT1SEL bits and set according to wwdgt_clock_source */
            reg &= ~RCU_CFG3_WWDGT1SEL;
            RCU_CFG3 = (reg | (uint32_t)(wwdgt_clock_source) << 3U);
            break;
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
        default:
            break;
        }
    }
}

/*!
    \brief      configure the FWDGT clock source selection (API_ID(0x0013U))
    \param[in]  fwdgt_periph: FWDGTx(x=0,1)(FWDGT1 is not applicable to GD32A711X_A712X)
    \param[in]  fwdgt_clock_source: FWDGT clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_FWDGTSRC_IRC40K: IRC40k clock selected as FWDGT source clock
      \arg        RCU_FWDGTSRC_LXTAL: LXTAL clock selected as FWDGT source clock
    \param[out] none
    \retval     none
*/
void rcu_fwdgt_clock_config(uint32_t fwdgt_periph, uint32_t fwdgt_clock_source)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_FWDGT_PERIPH(fwdgt_periph)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    } else if(NOT_RCU_FWDGTSRC(fwdgt_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0013U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(fwdgt_periph) {
        case FWDGT0:
            reg = RCU_CFG1;
            /* reset the FWDGT0SEL bits and set according to fwdgt_clock_source */
            reg &= ~RCU_CFG1_FWDGT0SEL;
            RCU_CFG1 = (reg | (uint32_t)(fwdgt_clock_source) << 15U);
            break;
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        case FWDGT1:
            reg = RCU_CFG2;
            /* reset the FWDGT1SEL bits and set according to fwdgt_clock_source */
            reg &= ~RCU_CFG2_FWDGT1SEL;
            RCU_CFG2 = (reg | (uint32_t)(fwdgt_clock_source) << 26U);
            break;
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
        default:
            break;
        }
    }
}

/*!
    \brief      configure the LINFlexD clock source selection (API_ID(0x0014U))
    \param[in]  linflexd_clock_source: LINFlexD clock source selection
                only one parameter LINFlexD be selected which is shown as below:
      \arg        RCU_LINFLEXDSRC_CKSYS: CK_SYS clock selected as LINFlexD source clock
      \arg        RCU_LINFLEXDSRC_HXTAL: HXTAL clock selected as LINFlexD source clock
      \arg        RCU_LINFLEXDSRC_PLL_P: PLL_P clock selected as LINFlexD source clock
      \arg        RCU_LINFLEXDSRC_IRC48M: IRC48M clock selected as LINFlexD source clock
    \param[in]  linflexddiv: LIN clock division(LIN_clock/linflexddiv)
                only one parameter can be selected which is shown as below:
      \arg        this parameter should be selected as 1,2,..,14,15

    \param[out] none
    \retval     none
*/
void rcu_linflexd_clock_config(uint32_t linflexd_clock_source, uint32_t linflexddiv)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_LINFLEXDSRC(linflexd_clock_source) || (linflexddiv == 0U)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0014U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG3;
        /* reset the LINFlexDSEL bits and set according to linflexd_clock_source */
        reg &= ~(RCU_CFG3_LINFLEXDSEL | RCU_CFG3_LINFLEXDDIV);
        RCU_CFG3 = (reg | (linflexd_clock_source | (((linflexddiv - 1U) & (0xFU)) << 10U)));
    }
}

/*!
    \brief      configure the AIT clock source selection (API_ID(0x0015U))
    \param[in]  ait_clock_source: AIT clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKAITSRC_IRC48M: AIT clock source select CK_IRC48M
      \arg        RCU_CKAITSRC_CK_PLL_Q_DIV2: AIT clock source select CK_PLL_Q/2
      \arg        RCU_CKAITSRC_CK_PLL_Q_DIV3: AIT clock source select CK_PLL_Q/3
      \arg        RCU_CKAITSRC_CK_PLL_Q_DIV4: AIT clock source select CK_PLL_Q/4
    \param[out] none
    \retval     none
*/
void rcu_ait_clock_config(uint32_t ait_clock_source)
{
    uint32_t reg;
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKAITSRC(ait_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG1;
        /* reset the AITSEL bits and set according to ait_clock_source */
        reg &= ~RCU_CFG1_AITSEL;
        RCU_CFG1 = (reg | (uint32_t)(ait_clock_source));
    }
}

