sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.c
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      configure the ATE clock source selection (API_ID(0x0016U))
    \param[in]  ait_clock_source: ATE clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKATESRC_IRC48M: ATE clock source select CK_IRC48M
      \arg        RCU_CKATESRC_CK_PLL_Q_DIV2: ATE clock source select CK_PLL_Q/2
      \arg        RCU_CKATESRC_CK_PLL_Q_DIV3: ATE clock source select CK_PLL_Q/3
      \arg        RCU_CKATESRC_CK_PLL_Q_DIV4: ATE clock source select CK_PLL_Q/4
    \param[out] none
    \retval     none
*/
void rcu_ate_clock_config(uint32_t ate_clock_source)
{
    uint32_t reg;
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKATESRC(ate_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG1;
        /* reset the ATESEL bits and set according to ate_clock_source */
        reg &= ~RCU_CFG1_ATESEL;
        RCU_CFG1 = (reg | (uint32_t)(ate_clock_source));
    }
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      configure the TRACE clock source selection (API_ID(0x0017U))
    \param[in]  trace_clock_source: TRACE clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_TRACESRC_PLLQ: PLLQ is selected as TRACE clock source
      \arg        RCU_TRACESRC_PLLP: PLLP is selected as TRACE clock source
      \arg        RCU_TRACESRC_HXTAL: HXTAL is selected as TRACE clock source
      \arg        RCU_TRACESRC_IRC48M: IRC48M is selected as TRACE clock source
    \param[in]  trace_clock_psc: TRACE clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKTRACE_DIV1: TRACE clock is divided by 1
      \arg        RCU_CKTRACE_DIV2: TRACE clock is divided by 2
      \arg        RCU_CKTRACE_DIV3: TRACE clock is divided by 3
      \arg        RCU_CKTRACE_DIV4: TRACE clock is divided by 4
      \arg        RCU_CKTRACE_DIV5: TRACE clock is divided by 5
      \arg        RCU_CKTRACE_DIV6: TRACE clock is divided by 6
      \arg        RCU_CKTRACE_DIV7: TRACE clock is divided by 7
      \arg        RCU_CKTRACE_DIV8: TRACE clock is divided by 8
    \param[out] none
    \retval     none
*/
void rcu_trace_clock_source_config(uint32_t trace_clock_source, uint32_t trace_clock_psc)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_TRACESRC(trace_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0017U), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKTRACE_DIV(trace_clock_psc)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0017U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG3;
        /* reset the TRACESEL and TRACEDIV bits and set according to ate_clock_source */
        reg &= ~(RCU_CFG3_TRACESEL | RCU_CFG3_TRACEDIV);
        RCU_CFG3 = (reg | (uint32_t)(trace_clock_source) | (uint32_t)(trace_clock_psc));
    }
}

/*! \brief      configure the QSPI clock source selection (API_ID(0x0018U))
    \param[in]  qspi_clock_source: QSPI clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_QSPISRC_PLLQ: PLLQ is selected as QSPI clock source
      \arg        RCU_QSPISRC_PLLP: PLLP is selected as QSPI clock source
      \arg        RCU_QSPISRC_HCLK: HCLK is selected as QSPI clock source
      \arg        RCU_QSPISRC_IRC48M: IRC48M is selected as QSPI clock source
    \param[out] none
    \retval     none
*/
void rcu_qspi_clock_source_config(uint32_t qspi_clock_source)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_QSPISRC(qspi_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0018U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG3;
        /* reset the QSPISEL bits and set according to qspi_clock_source */
        reg &= ~RCU_CFG3_QSPISEL;
        RCU_CFG3 = (reg | (uint32_t)(qspi_clock_source));
    }
}

/*! \brief      configure the LXTAL drive capability (API_ID(0x0019U))
    \param[in]  lxtal_dricap: drive capability of LXTAL
                only one parameter can be selected which is shown as below:
      \arg        RCU_LXTAL_LOWDRI: lower driving capability
      \arg        RCU_LXTAL_MED_LOWDRI: medium low driving capability
      \arg        RCU_LXTAL_MED_HIGHDRI: medium high driving capability
      \arg        RCU_LXTAL_HIGHDRI: higher driving capability
    \param[out] none
    \retval     none
*/
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap)
{
    uint32_t reg;

#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_LXTAL_DRIVE(lxtal_dricap)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0019U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_BDCTL;
        /* reset the LXTALDRI bits and set according to lxtal_dricap */
        reg &= ~RCU_BDCTL_LXTALDRI;
        RCU_BDCTL = (reg | lxtal_dricap);
    }
}

/*! \brief      wait for oscillator stabilization flags is SET or oscillator startup is timeout (API_ID(0x001AU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
      \arg        RCU_PLL_CK: phase locked loop(PLL)
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci)
{
    uint32_t stb_cnt = 0U;
    ErrStatus reval = ERROR;
    FlagStatus osci_stat = RESET;

    switch(osci) {
    /* wait HXTAL stable */
    case RCU_HXTAL:
        while((RESET == osci_stat) && (HXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_HXTALSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_HXTALSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait LXTAL stable */
    case RCU_LXTAL:
        while((RESET == osci_stat) && (LXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_LXTALSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_LXTALSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait PLL stable */
    case RCU_PLL_CK:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_PLLSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_PLLSTB)) {
            reval = SUCCESS;
        }
        break;
    default:
        break;
    }
    /* return value */
    return reval;
}

/*! \brief      turn on the oscillator (API_ID(0x001BU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
      \arg        RCU_PLL_CK: phase locked loop(PLL)
    \param[out] none
    \retval     none
*/
void rcu_osci_on(rcu_osci_type_enum osci)
{
    RCU_CCTL_REG_VAL(osci) |= BIT(RCU_BIT_POS(osci));
}

/*! \brief      turn off the oscillator (API_ID(0x001CU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
      \arg        RCU_PLL_CK: phase locked loop(PLL)
    \param[out] none
    \retval     none
*/
void rcu_osci_off(rcu_osci_type_enum osci)
{
    RCU_CCTL_REG_VAL(osci) &= ~BIT(RCU_BIT_POS(osci));
}

/*! \brief      enable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it (API_ID(0x001DU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_enable(rcu_osci_type_enum osci)
{
    uint32_t reg;

    switch(osci) {
    /* enable HXTAL to bypass mode */
    case RCU_HXTAL:
        reg = RCU_CTL;
        RCU_CTL &= ~RCU_CTL_HXTALEN;
        RCU_CTL = (reg | RCU_CTL_HXTALBPS);
        break;
    /* enable LXTAL to bypass mode */
    case RCU_LXTAL:
        reg = RCU_BDCTL;
        RCU_BDCTL &= ~RCU_BDCTL_LXTALEN;
        RCU_BDCTL = (reg | RCU_BDCTL_LXTALBPS);
        break;
    default:
        break;
    }
}

/*! \brief      disable the oscillator bypass mode, HXTALEN or LXTALEN must be reset before it (API_ID(0x001EU))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_LXTAL: low speed crystal oscillator(LXTAL)
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_disable(rcu_osci_type_enum osci)
{
    uint32_t reg;

    switch(osci) {
    /* disable HXTAL to bypass mode */
    case RCU_HXTAL:
        reg = RCU_CTL;
        RCU_CTL &= ~RCU_CTL_HXTALEN;
        RCU_CTL = (reg & ~RCU_CTL_HXTALBPS);
        break;
    /* disable LXTAL to bypass mode */
    case RCU_LXTAL:
        reg = RCU_BDCTL;
        RCU_BDCTL &= ~RCU_BDCTL_LXTALEN;
        RCU_BDCTL = (reg & ~RCU_BDCTL_LXTALBPS);
        break;
    default:
        break;
    }
}

/*! \brief      HXTAL frequency scale select (API_ID(0x001FU))
    \param[in]  hxtal_scal: HXTAL frequency scale
                only one parameter can be selected which is shown as below:
      \arg        HXTAL_SCALE_4M_TO_8M: HXTAL scale is 4-8MHz
      \arg        HXTAL_SCALE_8M_TO_16M: HXTAL scale is 8-16MHz
      \arg        HXTAL_SCALE_16M_TO_32M: HXTAL scale is 16-32MHz
      \arg        HXTAL_SCALE_32M_TO_40M: HXTAL scale is 32-40MHz
    \param[out] none
    \retval     none
*/
void rcu_hxtal_frequency_scale_select(uint32_t hxtal_scal)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_HXTAL_SCALE(hxtal_scal)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CTL &= ~RCU_CTL_HXTALSCAL;
        RCU_CTL |= hxtal_scal;
    }
}

/*!
    \brief      configure the HXTAL or IRC48M divider used as input of PLL (API_ID(0x0020U))
    \param[in]  prediv: clock perescaler
                only one parameter can be selected which is shown as below:
      \arg        RCU_PREDV_DIVx(x=1..7): HXTAL divided x used as input of PLL
    \param[out] none
    \retval     none
*/
void rcu_prediv_config(uint32_t prediv)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_PREDV_DIV(prediv)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CFG1;
        /* reset the PREDV bits and set according to prediv */
        reg &= ~RCU_CFG1_PREDV;
        RCU_CFG1 = (reg | prediv);
    }
}

/*!
    \brief      set the IRC48M adjust value (API_ID(0x0021U))
    \param[in]  irc48m_adjval: IRC48M adjust value, must be between 0 and 0x1F
                only one parameter can be selected which is shown as below:
      \arg        0x00 - 0x1F
    \param[out] none
    \retval     none
*/
void rcu_irc48m_adjust_value_set(uint32_t irc48m_adjval)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_IRC48M_ADJVAL_RANGE(irc48m_adjval)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0021U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_CTL;
        /* reset the IRC48MADJ bits and set according to irc48m_adjval */
        reg &= ~RCU_CTL_IRC48MADJ;
        RCU_CTL = (reg | ((irc48m_adjval & RCU_IRC48M_ADJUST_MASK) << RCU_IRC48M_ADJUST_OFFSET));
    }
}
/*!
    \brief     configure the IRC48M fail responsee (API_ID(0x0022U))
    \param[in]  irc48m_fail: IRC48M fail response
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC48M_POR: IRC48M fail response,POR reset is triggered
      \arg        RCU_FFIO0_FFIO1: the failure of IRC48M will set FFIO0 and FFIO1 pins to High-Z state
    \param[out] none
    \retval     none
*/
void rcu_irc48m_fail_response_config(uint32_t irc48m_fail)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(irc48m_fail != RCU_IRC48M_POR && irc48m_fail != RCU_FFIO0_FFIO1) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0022U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CFG1 &= ~RCU_CFG1_IRC48MFR;
        RCU_CFG1 |= (irc48m_fail << 30U);
    }
}

/*! \brief      enable the HXTAL clock monitor (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_clock_monitor_enable(void)
{
    RCU_CTL |= RCU_CTL_CKMEN;
}

/*! \brief      disable the HXTAL clock monitor (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_hxtal_clock_monitor_disable(void)
{
    RCU_CTL &= ~RCU_CTL_CKMEN;
}

/*!
    \brief      frequency monitor enable (API_ID(0x0025U))
    \param[in]  uint32_t: CKFMx(x=0...4)  only one parameter can be selected
    \param[out] none
    \retval     none
*/
void rcu_frequency_monitor_enable(uint32_t ckfmx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFM_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMCTL(ckfmx) |= RCU_CKFMCTL_FMEN;
    }
}

/*!
    \brief      frequency monitor disable (API_ID(0x0026U))
    \param[in]  ckfmx: CKFMx(x=0...4) only one parameter can be selected
    \param[out] none
    \retval     none
*/
void rcu_frequency_monitor_disable(uint32_t ckfmx)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFM_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0026U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMCTL(ckfmx) &= ~RCU_CKFMCTL_FMEN;
    }
}

/*!
    \brief      frequency monitor0 system reset enable (API_ID(0x0027U))
    \param[in]  sys_rst: frequency monitor0 (CKFM0) system reset
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKFMCTL_FHMAXRE: Frequency higher than FHMAX system reset enable
      \arg        RCU_CKFMCTL_FLMINRE: Frequency lower than FLMIN system reset enable
    \param[out] none
    \retval     none
*/
void rcu_frequency_monitor0_system_reset_enable(uint32_t sys_rst)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFMCTL_RST(sys_rst)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
     } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMCTL(0U) |= sys_rst;
    }
}

/*!
    \brief      frequency monitor0 system reset disable (API_ID(0x0028U))
    \param[in]  sys_rst: frequency monitor0 (CKFM0) system reset
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKFMCTL_FLMINRE: Frequency lower than FLMIN system reset disable
      \arg        RCU_CKFMCTL_FHMAXRE: Frequency higher than FHMAX system reset disable
    \param[out] none
    \retval     none
*/
void rcu_frequency_monitor0_system_reset_disable( uint32_t sys_rst)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFMCTL_RST(sys_rst)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMCTL(0U) &= ~sys_rst;
    }
}

/*!
    \brief      frequency monitor system reset enable (API_ID(0x0029U))
    \param[in]  ckfmx: CKFMx(x=1,2) only one parameter can be selected
    \param[in]  interrupt: frequency monitor interrupt
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKFMCTL_FHMAXIE: Frequency higher than FHMAX system reset enable
      \arg        RCU_CKFMCTL_FLMINIE: Frequency lower than FLMIN system reset enable
    \param[out] none
    \retval     none
*/
void rcu_frequency_monitor_system_reset_enable(uint32_t ckfmx, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFMCTL_RST_1(interrupt)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0029U), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKFM_RST_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0029U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMCTL(ckfmx) |= interrupt;
    }
}

/*!
    \brief      frequency monitor system reset disable (API_ID(0x002AU))
    \param[in]  ckfmx: CKFMx(x=1,2) only one parameter can be selected
    \param[in]  interrupt: frequency monitor interrupt
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKFMCTL_FLMINIE: Frequency lower than FLMIN system reset disable
      \arg        RCU_CKFMCTL_FHMAXIE: Frequency higher than FHMAX system reset disable
    \param[out] none
    \retval     none
*/
void rcu_frequency_monitor_system_reset_disable(uint32_t ckfmx, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFMCTL_RST_1(interrupt)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002AU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKFM_RST_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMCTL(ckfmx) &= ~interrupt;
    }
}

/*!
    \brief      frequency monitor interrupt enable (API_ID(0x002BU))
    \param[in]  ckfmx: CKFMx(x=0,3,4) only one parameter can be selected
    \param[in]  interrupt: frequency monitor interrupt
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKFMCTL_FLMINIE: Frequency lower than FLMIN interrupt disable
      \arg        RCU_CKFMCTL_FHMAXIE: Frequency higher than FHMAX interrupt disable
    \param[out] none
    \retval     none
*/
void rcu_frequency_monitor_interrupt_enable(uint32_t ckfmx, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFMCTL_INI(interrupt)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002BU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKFM_INT_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMCTL(ckfmx) |= interrupt;
    }
}

/*! \brief      frequency monitor interrupt disable (API_ID(0x002CU))
    \param[in]  uint32_t: CKFMx(x=0,3,4) only one parameter can be selected
    \param[in]  interrupt: frequency monitor interrupt
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKFMCTL_FLMINIE: Frequency lower than FLMIN interrupt disable
      \arg        RCU_CKFMCTL_FHMAXIE: Frequency higher than FHMAX interrupt disable
    \param[out] none
    \retval     none
*/
void rcu_frequency_monitor_interrupt_disable(uint32_t ckfmx, uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFMCTL_INI(interrupt)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002CU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKFM_INT_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMCTL(ckfmx) &= ~interrupt;
    }
}

/*!
    \brief      get frequency monitor flag (API_ID(0x002DU))
    \param[in]  ckfmx: CKFMx(x=0...4) only one parameter can be selected
    \param[in]  interrupt_flag: frequency monitor flag
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_FLMIN: Frequency lower than low frequency reference threshold event status
      \arg        RCU_FLAG_FHMAX: Frequency higher than high frequency reference threshold event status
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_frequency_monitor_flag_get(uint32_t ckfmx, uint32_t interrupt_flag)
{
    FlagStatus flag = RESET ;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if((interrupt_flag != RCU_FLAG_FLMIN) && (interrupt_flag != RCU_FLAG_FHMAX)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002DU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKFM_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(interrupt_flag == (RCU_CKFMCTL(ckfmx) & (interrupt_flag))) {
            flag = SET;
        } else {
            flag = RESET;
        }
    }
    return flag;
}

/*! \brief      clear frequency monitor interrupt flag (API_ID(0x002EU))
    \param[in]  ckfmx: CKFMx(x=0...4) only one parameter can be selected
    \param[in]  interrupt_flag: frequency monitor flag
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_FLMIN: Frequency lower than low frequency reference threshold event status
      \arg        RCU_FLAG_FHMAX: Frequency higher than high frequency reference threshold event status
    \param[out] none
    \retval     none
*/
void rcu_frequency_monitor_flag_clear(uint32_t ckfmx, uint32_t interrupt_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if((interrupt_flag != RCU_FLAG_FLMIN) && (interrupt_flag != RCU_FLAG_FHMAX)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002EU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKFM_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMCTL(ckfmx) = interrupt_flag;
    }
}


/*!
    \brief      reference count configuration (API_ID(0x002FU))
    \param[in]  uint32_t: CKFMx(x=0...4) only one parameter can be selected
    \param[in]  count: reference count, only one parameter can be selected
    \param[out] none
    \retval     none
*/
void rcu_reference_count_config(uint32_t ckfmx, uint32_t count)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFM_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMRCCFG(ckfmx) &= ~RCU_CKFMRCCFG_REF_CNT;
        RCU_CKFMRCCFG(ckfmx) |= (RCU_CKFMRCCFG_REF_CNT & count);
    }
}

/*!
    \brief      reference count configuration (API_ID(0x0030U))
    \param[in]  uint32_t: CKFMx(x=0...4) only one parameter can be selected
    \param[in]  hthreshold: high frequency reference threshold, only one parameter can be selected
    \param[out] none
    \retval     none
*/
void rcu_monitored_hthreshold_config(uint32_t ckfmx, uint32_t hthreshold)
{
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFM_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0030U), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMHTHCFG(ckfmx) &= ~RCU_CKFMHTHCFG_HFMAX;
        RCU_CKFMHTHCFG(ckfmx) |= (RCU_CKFMHTHCFG_HFMAX & hthreshold);
    }
}

