sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.c
/*!
    \brief      reference count configuration (API_ID(0x0031U))
    \param[in]  uint32_t: CKFMx(x=0...4) only one parameter can be selected
    \param[in]  lthreshold: low frequency reference threshold, only one parameter can be selected
    \param[out] none
    \retval     none
*/
void rcu_monitored_lthreshold_config(uint32_t ckfmx, uint32_t lthreshold)
{
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CKFM_PERIPH(ckfmx)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0031U), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_CKFMLTHCFG(ckfmx) &= ~RCU_CKFMLTHCFG_LFMIN;
        RCU_CKFMLTHCFG(ckfmx) |= (RCU_CKFMLTHCFG_LFMIN & lthreshold);
    }
}

/*!
    \brief      frequency detect enable (API_ID(0x0032U))
    \param[in]  ckd_enum: CKDx(x=0...2),(CKD2 is not applicable to GD32A711X_A712X)
                only one parameter can be selected
    \param[out] none
    \retval     none
*/
void rcu_frequency_detect_enable(ckd_enum ckdx)
{
    RCU_CKDCTL |= (uint32_t)1U << ((uint32_t)ckdx << 3U);
}

/*!
    \brief      frequency detect disable (API_ID(0x0033U))
    \param[in]  ckd_enum: CKDx(x=0...2)(CKD2 is not applicable to GD32A711X_A712X)
                only one parameter can be selected
    \param[out] none
    \retval     none
*/
void rcu_frequency_detect_disable(ckd_enum ckdx)
{
    RCU_CKDCTL &= ~((uint32_t)1U << ((uint32_t)ckdx << 3U));
}

/*!
    \brief      frequency detect interrupt enable (API_ID(0x0034U))
    \param[in]  ckd_enum: CKDx(x=0...2)(CKD2 is not applicable to GD32A711X_A712X)
                only one parameter can be selected
    \param[out] none
    \retval     none
*/
void rcu_frequency_detect_error_interrupt_enable(ckd_enum ckdx)
{
    RCU_CKDCTL |= (uint32_t)4U << ((uint32_t)ckdx << 3U);
}

/*!
    \brief      frequency detect interrupt disable (API_ID(0x0035U))
    \param[in]  ckd_enum: CKDx(x=0...2)(CKD2 is not applicable to GD32A711X_A712X)
                only one parameter can be selected
    \param[out] none
    \retval     none
*/
void rcu_frequency_detect_error_interrupt_disable(ckd_enum ckdx)
{
    RCU_CKDCTL &= ~((uint32_t)4U << ((uint32_t)ckdx << 3U));
}

/*!
    \brief      get the system clock, bus and peripheral clock frequency (API_ID(0x0036U))
    \param[in]  clock: the clock frequency which to get
                only one parameter can be selected which is shown as below:
      \arg        CK_SYS: system clock frequency
      \arg        CK_AHB: AHB clock frequency
      \arg        CK_APB1: APB1 clock frequency
      \arg        CK_APB2: APB2 clock frequency
      \arg        CK_LINFLEXD: LINFlexD clock frequency
    \param[out] none
    \retval     clock frequency of system, AHB, APB1, APB2, LINFlexD
*/
uint32_t rcu_clock_freq_get(rcu_clock_freq_enum clock)
{
    uint32_t sws, ck_freq = 0U;
    uint32_t cksys_freq, ahb_freq, apb1_freq, apb2_freq, pll_freq = 0U;
    uint32_t linflexd_freq, linflexd_div;
    uint32_t pllsel, pllmf, plldivp, ck_src, idx, clk_exp;
    uint32_t predv0;

    /* exponent of AHB, APB1 and APB2 clock divider */

    uint16_t ahb_exp[16] = {0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 2U, 4U, 8U, 16U, 64U, 128U, 256U, 512U};
    uint8_t apb1_exp[8] = {0U, 0U, 0U, 0U, 2U, 4U, 8U, 16U};
    uint8_t apb2_exp[8] = {0U, 0U, 0U, 0U, 2U, 4U, 8U, 16U};

    sws = RCU_CFG0 & RCU_CFG0_SCSS;
    switch(sws) {
    /* IRC48M is selected as CK_SYS */
    case RCU_SCSS_IRC48M:
        cksys_freq = IRC48M_VALUE;
        break;
    /* HXTAL is selected as CK_SYS */
    case RCU_SCSS_HXTAL:
        cksys_freq = HXTAL_VALUE;
        break;
    /* PLL is selected as CK_SYS */
    case RCU_SCSS_PLL_P:
        /* PLL clock source selection, HXTAL or IRC48M */
        pllsel = (RCU_CFG0 & RCU_CFG0_PLLSEL);
        if(RCU_PLLSRC_HXTAL == pllsel) {
            /* PLL clock source is HXTAL */
            ck_src = HXTAL_VALUE;
            predv0 = (RCU_CFG1 & RCU_CFG1_PREDV);
            if(predv0 != 0U) {
                ck_src /= predv0;
            }
        } else {
            /* PLL clock source is IRC48M */
            ck_src = IRC48M_VALUE ;
            predv0 = (RCU_CFG1 & RCU_CFG1_PREDV);
            if(predv0 != 0U) {
                ck_src /= predv0;
            }
        }
        /* PLL multiplication factor */
        pllmf = GET_BITS(RCU_CFG0, 17U, 23U);
        if((RCU_CFG0 & RCU_CFG0_PLLMF_7) != 0U) {
            pllmf += 128U;
        }
        plldivp =  GET_BITS(RCU_CFG1, 3U, 8U);
        pll_freq = (ck_src * pllmf) / (plldivp + 1U);
        cksys_freq = pll_freq;
        break;
    /* IRC48M is selected as CK_SYS */
    default:
        cksys_freq = IRC48M_VALUE;
        break;
    }
    /* calculate AHB clock frequency */
    idx = GET_BITS(RCU_CFG0, 4U, 7U);
    clk_exp = ahb_exp[idx];
    if(clk_exp != 0U) {
        ahb_freq = cksys_freq / clk_exp;
    } else {
        ahb_freq = cksys_freq;
    }
    /* calculate APB1 clock frequency */
    idx = GET_BITS(RCU_CFG0, 8U, 10U);
    clk_exp = apb1_exp[idx];
    if(clk_exp != 0U) {
        apb1_freq = ahb_freq / clk_exp;
    } else {
        apb1_freq = ahb_freq;
    }
    /* calculate APB2 clock frequency */
    idx = GET_BITS(RCU_CFG0, 11U, 13U);
    clk_exp = apb2_exp[idx];
    if(clk_exp != 0U) {
        apb2_freq = ahb_freq / clk_exp;
    } else {
        apb2_freq = ahb_freq;
    }
    if((RCU_CTL & RCU_CTL_PLLSTB) == RCU_CTL_PLLSTB) {
        /* PLL clock source selection, HXTAL or IRC48M */
        pllsel = (RCU_CFG0 & RCU_CFG0_PLLSEL);
        if(RCU_PLLSRC_HXTAL == pllsel) {
            /* PLL clock source is HXTAL */
            ck_src = HXTAL_VALUE;
        } else {
            /* PLL clock source is IRC48M */
            ck_src = IRC48M_VALUE ;
        }
        predv0 = (RCU_CFG1 & RCU_CFG1_PREDV);
        if(predv0 == 0U) {
            predv0 = 1U;
            ck_src /= predv0;
        } else {
            ck_src /= predv0;
        }
        /* PLL multiplication factor */
        pllmf = GET_BITS(RCU_CFG0, 17U, 23U);
        if((RCU_CFG0 & RCU_CFG0_PLLMF_7) != 0U) {
            pllmf += 128U;
        }
        plldivp =  GET_BITS(RCU_CFG1, 3U, 8U);
        pll_freq = (ck_src * pllmf) / (plldivp + 1U);
    }
    /* return the clocks frequency */
    switch(clock) {
    case CK_SYS:
        ck_freq = cksys_freq;
        break;
    case CK_AHB:
        ck_freq = ahb_freq;
        break;
    case CK_APB1:
        ck_freq = apb1_freq;
        break;
    case CK_APB2:
        ck_freq = apb2_freq;
        break;
    case CK_LINFLEXD:
        linflexd_div = GET_BITS(RCU_CFG3, 10U, 13U);
        /* calculate LINFlexDX clock frequency */
        if((RCU_CFG3 & RCU_CFG3_LINFLEXDSEL) == RCU_LINFLEXDSRC_HXTAL) {
            linflexd_freq = HXTAL_VALUE / (linflexd_div + 1U);
        } else if((RCU_CFG3 & RCU_CFG3_LINFLEXDSEL) == RCU_LINFLEXDSRC_IRC48M) {
            linflexd_freq = IRC48M_VALUE / (linflexd_div + 1U);
        } else if((RCU_CFG3 & RCU_CFG3_LINFLEXDSEL) == RCU_LINFLEXDSRC_CKSYS) {
            linflexd_freq = cksys_freq / (linflexd_div + 1U);
        } else  {
            linflexd_freq = pll_freq / (linflexd_div + 1U);
        }
        ck_freq = linflexd_freq;
        break;
    default:
        break;
    }
    return ck_freq;
}
/*!
    \brief      clear the system reset flag  (API_ID(0x0037U))
    \param[in]  flag: the system reset flag
                only one parameter can be selected which is shown as below:
    \arg        RCU_FLAG_POR:Power-on reset flag
    \arg        RCU_FLAG_FMU_REA_FAIL: System reset flag FMU_REA_FAIL
    \arg        RCU_FLAG_STCM_REC_FAIL: System reset flag STCM_REC_FAIL
    \arg        RCU_FLAG_RCTL_SUBSRU: System reset flag RCTL_SUBSRUF
    \arg        RCU_FLAG_LOHRST: Lost of HXTAL error reset flag
    \arg        RCU_FLAG_LOPRST: Lost of PLL error reset flag
    \arg        RCU_FLAG_CORE_CK_FAIL: Core clock fail reset flag
    \arg        RCU_FLAG_SYS_CK_FAIL: CK_SYS fail reset flag
    \arg        RCU_FLAG_HSM_SYSRST: System reset flag HSM_SYS_RSTF
    \arg        RCU_FLAG_SW_SYSRST: System reset flag SW_SYS_RSTF
    \arg        RCU_FLAG_DBG_SYSRST: System reset flag DBG_SYS_RSTF
    \param[out] none
    \retval     none
*/
void rcu_system_reset_flag_clear(uint32_t sysrst_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_SYS_RESET_FLAG(sysrst_flag)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0037U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_SYSRSTSTAT = sysrst_flag;
    }
}

/*!
    \brief      clear the subsystem reset flag (API_ID(0x0038U))
    \param[in]  flag: the subsystem reset flag
                 only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_EXTRST: External reset flag EXRF
      \arg        RCU_FLAG_OBSTDBY: Subsystem reset flag OBSTDBY_RSTF
      \arg        RCU_FLAG_FMU: Subsystem reset flag FMU_RSTF
      \arg        RCU_SUBSERSTAT_ST_FINISH: Subsystem reset flag ST_FINISH
      \arg        RCU_FLAG_FWDGT0: Subsystem reset flag FWDGT0_RSTF
      \arg        RCU_FLAG_FWDGT1: Subsystem reset flag FWDGT1_RSTF (not applicable to GD32A711X_A712X)
      \arg        RCU_FLAG_SWRST: Software reset flag
      \arg        RCU_FLAG_WWDGT0: Subsystem reset flag WWDGT0_RSTF
      \arg        RCU_FLAG_WWDGT1: Subsystem reset flag WWDGT1_RSTF (not applicable to GD32A711X_A712X)
      \arg        RCU_FLAG_HSM_WDGT: Subsystem reset flag HSM_WDGT_RSTF
      \arg        RCU_FLAG_HSM_APP: Subsystem reset flag HSM_APP_RSTF
      \arg        RCU_FLAG_SW_SUBS: Subsystem reset flag SW_SUBS_RSTF
      \arg        RCU_FLAG_DBG: Debug reset flag DBG_RSTF
      \arg        RCU_FLAG_OBL: Option byte loader reset flag
    \param[out] none
    \retval     none
*/
void rcu_subsystem_reset_flag_clear(uint32_t subsysrst_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_SUBSYS_RESET_FLAG(subsysrst_flag)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0038U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_SUBSERSTAT = subsysrst_flag;
    }
}
/*!
    \brief      get the system reset flags (API_ID(0x0039U))
    \param[in]  flag: the system reset flag
                only one parameter can be selected which is shown as below:
    \arg        RCU_FLAG_POR:Power-on reset flag
    \arg        RCU_FLAG_FMU_REA_FAIL: System reset flag FMU_REA_FAIL
    \arg        RCU_FLAG_STCM_REC_FAIL: System reset flag STCM_REC_FAIL
    \arg        RCU_FLAG_RCTL_SUBSRU: System reset flag RCTL_SUBSRUF
    \arg        RCU_FLAG_LOHRST: Lost of HXTAL error reset flag
    \arg        RCU_FLAG_LOPRST: Lost of PLL error reset flag
    \arg        RCU_FLAG_CORE_CK_FAIL: Core clock fail reset flag
    \arg        RCU_FLAG_SYS_CK_FAIL: CK_SYS fail reset flag
    \arg        RCU_FLAG_HSM_SYSRST: System reset flag HSM_SYS_RSTF
    \arg        RCU_FLAG_SW_SYSRST: System reset flag SW_SYS_RSTF
    \arg        RCU_FLAG_DBG_SYSRST: System reset flag DBG_SYS_RSTF
    \param[out] none
    \retval     none
*/
FlagStatus rcu_system_reset_flag_get(uint32_t sysrst_flag)
{
    FlagStatus flag = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_SYS_RESET_FLAG(sysrst_flag)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0039U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the flag */
        if((RCU_SYSRSTSTAT & sysrst_flag) == sysrst_flag) {
            flag = SET;
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
    }
    return flag;
}

/*!
    \brief      get the subsystem reset flags (API_ID(0x003AU))
    \param[in]  flag: the subsystem reset flag
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_EXTRST: External reset flag EXRF
      \arg        RCU_FLAG_OBSTDBY: Subsystem reset flag OBSTDBY_RSTF
      \arg        RCU_FLAG_FMU: Subsystem reset flag FMU_RSTF
      \arg        RCU_SUBSERSTAT_ST_FINISH: Subsystem reset flag ST_FINISH
      \arg        RCU_FLAG_FWDGT0: Subsystem reset flag FWDGT0_RSTF
      \arg        RCU_FLAG_FWDGT1: Subsystem reset flag FWDGT1_RSTF (not applicable to GD32A711X_A712X)
      \arg        RCU_FLAG_SWRST: Software reset flag
      \arg        RCU_FLAG_WWDGT0: Subsystem reset flag WWDGT0_RSTF
      \arg        RCU_FLAG_WWDGT1: Subsystem reset flag WWDGT1_RSTF (not applicable to GD32A711X_A712X)
      \arg        RCU_FLAG_HSM_WDGT: Subsystem reset flag HSM_WDGT_RSTF
      \arg        RCU_FLAG_HSM_APP: Subsystem reset flag HSM_APP_RSTF
      \arg        RCU_FLAG_SW_SUBS: Subsystem reset flag SW_SUBS_RSTF
      \arg        RCU_FLAG_DBG: Debug reset flag DBG_RSTF
      \arg        RCU_FLAG_OBL: Option byte loader reset flag
    \param[out] none
    \retval     none
*/
FlagStatus rcu_subsystem_reset_flag_get(uint32_t subsysrst_flag)
{
    FlagStatus flag;
    flag = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_SUBSYS_RESET_FLAG(subsysrst_flag)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x003AU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the flag */
        if((RCU_SUBSERSTAT & subsysrst_flag) == subsysrst_flag) {
            flag = SET;
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
    }
    return flag;
}

/*!
    \brief      get subsystem reset upgrade counter (API_ID(0x003BU))
    \param[in]  none
    \param[out] none
    \retval     subsystem reset upgrade counter
*/
uint32_t rcu_subsystem_reset_upgrade_counter_get(void)
{
    return (RCU_SUBSRMUCNT & RCU_SUBSRMUCNT_SUBSRMUCNT);
}

/*!
    \brief      get system reset upgrade counter (API_ID(0x003CU))
    \param[in]  none
    \param[out] none
    \retval     system reset upgrade counter
*/
uint32_t rcu_system_reset_upgrade_counter_get(void)
{
    return (RCU_SYSRSTUCNT & RCU_SYSRSTUCNT_SYSRTOEN);
}

/*!
    \brief      get subsystem reset counter (API_ID(0x003DU))
    \param[in]  none
    \param[out] none
    \retval     subsystem reset counter
*/
uint32_t rcu_subsystem_reset_counter_get(void)
{
    return (RCU_SUBSRSTCNT & RCU_SUBSRSTCNT_SUBSRSTCNT);
}

/*!
    \brief      get system reset upgrade counter (API_ID(0x003EU))
    \param[in]  none
    \param[out] none
    \retval     system reset upgrade counter
*/
uint32_t rcu_system_reset_counter_get(void)
{
    return (RCU_SYSRSTCNT & RCU_SYSRSTCNT_SYSRSTCNT);
}

/*!
    \brief     clear subsystem reset upgrade counter (API_ID(0x003FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_subsystem_reset_upgrade_counter_clear(void)
{
    RCU_SUBSRMUCNT |= RCU_SUBSRMUCNT_SUBSRMUCNT;
}

/*!
    \brief      clear subsystem reset counter (API_ID(0x0040U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_subsystem_reset_counter_clear(void)
{
    RCU_SUBSRSTCNT |=  RCU_SUBSRSTCNT_SUBSRSTCNT;
}

/*!
    \brief      clear system reset counter (API_ID(0x0041U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_system_reset_counter_clear(void)
{
    RCU_SYSRSTCNT &= ~ RCU_SYSRSTCNT_SYSRSTCNT;
}

/*!
    \brief      config system reset upgrade threshold (API_ID(0x0042U))
    \param[in]  upgrade_threshold: system reset mode upgrade threshold,only one parameter can be selected
      \arg        This parameter should be selected between 0 and 0xF.
    \param[out] none
    \retval     none
*/
void rcu_system_reset_upgrade_threshold_config(uint32_t upgrade_threshold)
{
    uint32_t reg;
    reg = RCU_SYSMRUTH;
    /* reset the RCU_SYSMRUTH_SYSMRUTH bits and set according to upgrade_threshold */
    reg &= ~RCU_SYSMRUTH_SYSMRUTH;
    RCU_SYSMRUTH = (reg | (uint32_t)(upgrade_threshold & 0xFU));
}


/*! \brief      config subsystem reset upgrade threshold (API_ID(0x0043U))
    \param[in]  upgrade_threshold: subsystem reset mode upgrade counter,only one parameter can be selected
      \arg        This parameter should be selected between 0 and 0xF.
    \param[out] none
    \retval     none
*/
void rcu_subsystem_reset_upgrade_threshold_config(uint32_t upgrade_threshold)
{
    uint32_t reg;
    reg = RCU_SUBSRMUTH;
    /* reset the RCU_SUBSRMUTH_SUBSRMUTH bits and set according to upgrade_threshold */
    reg &= ~RCU_SUBSRMUTH_SUBSRMUTH;
    RCU_SUBSRMUTH = (reg | (uint32_t)(upgrade_threshold & 0xFU));
}

