sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.c
/*! \brief      enable bus access during SUBSRST1 stage (API_ID(0x0044U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_subsystem_reset_bus_access_enable(void)
{
    RCU_BUSCTL |= RCU_BUSCTL_BUSCTL;
}

/*! \brief      disable bus access during SUBSRST1 stage (API_ID(0x0045U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_subsystem_reset_bus_access_disable(void)
{
    RCU_BUSCTL &= ~RCU_BUSCTL_BUSCTL;
}

/*! \brief      enable external reset pin assert (API_ID(0x0046U)) NOTE: this API must use only as part of the mainreset domain self-test entry procedure.
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_external_reset_pin_assert_enable(void)
{
    RCU_ERPACFG |= RCU_ERPACFG_ERPAETEN;
}

/*! \brief      disable external reset pin assert (API_ID(0x0047U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_external_reset_pin_assert_disable(void)
{
    RCU_ERPACFG &= ~RCU_ERPACFG_ERPAETEN;
}

/*! \brief      config subsystem reset timer value (API_ID(0x0048U))
    \param[in]  timeout: subsystem reset mode upgrade counter
      \arg        This parameter should be selected between 0 and 0x7FFFFFFF.
    \param[out] none
    \retval     none
*/
void rcu_subsystem_reset_timeout_config(uint32_t timeout)
{
    uint32_t reg;
    reg = RCU_SUBSRTO;
    /* reset the RCU_SUBSRTO_SUBSRTO bits and set according to timeout */
    reg &= ~RCU_SUBSRTO_SUBSRTO;
    RCU_SUBSRTO = (reg | (uint32_t)((timeout & 0x7FFFFFFFU) << 1U));
}

/*!
    \brief      enable subsystem reset entry timer (API_ID(0x0049U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_subsystem_reset_entry_timer_enable(void)
{
    RCU_SUBSRTO |= RCU_SUBSRTO_SUBSRTOEN;
}

/*!
    \brief      disable subsystem reset entry timer (API_ID(0x004AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_subsystem_reset_entry_timer_disable(void)
{
    RCU_SUBSRTO &= ~RCU_SUBSRTO_SUBSRTOEN;
}

/*!
    \brief      enable subsystem reset request (API_ID(0x004BU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
ErrStatus rcu_all_subsystem_reset_request_enable(void)
{
    ErrStatus status;
    RCU_SUBSRSTAD = 0x112B112BU;
    if(0U == (RCU_SUBSRSTAD & RCU_SUBSRSTAD_SUBSRST_ALL_DIS)) {
        status = SUCCESS;
    } else {
        status = ERROR;
    }
    return status;
}

/*!
    \brief      disable subsystem reset request (API_ID(0x004CU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
ErrStatus rcu_all_subsystem_reset_request_disable(void)
{
    ErrStatus status;
    RCU_SUBSRSTAD = 0xA211A211U;
    if(0U != (RCU_SUBSRSTAD & RCU_SUBSRSTAD_SUBSRST_ALL_DIS)) {
        status = SUCCESS;
    } else {
        status = ERROR;
    }
    return status;
}

/*! \brief      get the standby reset flags (API_ID(0x004DU))
    \param[in]  flag: standby reset flag
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_SYSRST: system reset event occurred flag in standby mode
      \arg        RCU_FLAG_SUBSRST: subsystem reset event occurred flag in standby mode
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_standby_reset_flag_get(uint32_t flag)
{
    FlagStatus reset_flag = RESET;
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_STANDBY_RESET_FLAG(flag)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x004DU), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the loss of lock detector flag */
        if(flag == (RCU_RDSMSTAT & flag)) {
            reset_flag = SET;
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
    }
    return reset_flag;
}

/*!
    \brief      clear the standby reset flags (API_ID(0x004EU))
    \param[in]  flag: standby reset flag
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_SYSRST: system reset event occurred flag in standby mode
      \arg        RCU_FLAG_SUBSRST: subsystem reset event occurred flag in standby mode
    \param[out] none
    \retval     none
*/
void rcu_standby_reset_flag_clear(uint32_t flag)
{
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_STANDBY_RESET_FLAG(flag)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x004EU), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_RDSMSTAT |= flag;
    }
}

/*!
    \brief      get the low power debug flag (API_ID(0x004FU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_low_power_debug_flag_get(void)
{
    FlagStatus flag;
    /* get the loss of lock detector flag */
    if(RCU_FLAG_LPDBG == (RCU_LPDBGSTAT & RCU_FLAG_LPDBG)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get the por watchdog overflow flags (API_ID(0x0050U))
    \param[in]  flag: por watchdog overflow flags
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_OVFx: x=0,..,6 or x=10,11,14(for GD32A711X_A712X),20 or x=29,..,30.
      \arg        RCU_FLAG_OVFx: x=32,..,63.
      \arg        RCU_FLAG_OVFx: x=64,..,95.
      \arg        RCU_FLAG_OVF96.
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_por_watchdog_overflow_flag_get(por_watchdog_overflow_flag_enum flag)
{
    FlagStatus verflow_flag = RESET;

    /* get the loss of lock detector flag */
    if(0U != (RCU_RCTL_REG_VAL(flag) & BIT(RCU_BIT_POS(flag)))) {
        verflow_flag = SET;
    } else {
        /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
    }
    return verflow_flag;
}

/*!
    \brief      clear the por watchdog overflow flags (API_ID(0x0051U))
    \param[in]  flag: por watchdog overflow flags
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_OVFx: x=0,..,6 or x=10,11,14(for GD32A711X_A712X),20 or x=29,..,30.
      \arg        RCU_FLAG_OVFx: x=32,..,63.
      \arg        RCU_FLAG_OVFx: x=64,..,95.
      \arg        RCU_FLAG_OVF96.
    \param[out] none
    \retval     none
*/
void rcu_por_watchdog_overflow_flag_clear(por_watchdog_overflow_flag_enum flag)
{
    RCU_RCTL_REG_VAL(flag) |= BIT(RCU_BIT_POS(flag));
}


/*!
    \brief      get the clock stabilization and peripheral reset flags (API_ID(0x0052U))
    \param[in]  flag: the clock stabilization and peripheral reset flags, refer to rcu_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_HXTALSTB: HXTAL stabilization flag
      \arg        RCU_FLAG_PLLSTB: PLL stabilization flag
      \arg        RCU_FLAG_LXTALSTB: LXTAL stabilization flag
    \param[out] none
    \retval     none
*/
FlagStatus rcu_flag_get(rcu_flag_enum flag)
{
    FlagStatus return_flag;
    return_flag = RESET;

    /* get the rcu flag */
    if(0U != (RCU_CCTL_REG_VAL(flag) & BIT(RCU_BIT_POS(flag)))) {
        return_flag = SET;
    } else {
        /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
    }
    return return_flag;
}

/*!
    \brief      get the clock stabilization interrupt and ckm flags (API_ID(0x0053U))
    \param[in]  int_flag: interrupt and ckm flags, refer to rcu_int_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_FLAG_LXTALSTB: LXTAL stabilization interrupt flag
      \arg        RCU_INT_FLAG_HXTALSTB: HXTAL stabilization interrupt flag
      \arg        RCU_INT_FLAG_PLLSTB: PLL stabilization interrupt flag
      \arg        RCU_INT_FLAG_CKM: HXTAL clock stuck interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_interrupt_flag_get(rcu_int_flag_enum int_flag)
{
    FlagStatus flag = RESET;

    /* get the rcu interrupt flag */
    if(0U != (RCU_CCTL_REG_VAL(int_flag) & BIT(RCU_BIT_POS(int_flag)))) {
        flag = SET;
    } else {
        /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
    }
    return flag;
}

/*!
    \brief      clear the interrupt flags (API_ID(0x0054U))
    \param[in]  int_flag: clock stabilization and stuck interrupt flags clear, refer to rcu_int_flag_clear_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_FLAG_LXTALSTB_CLR: LXTAL stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_HXTALSTB_CLR: HXTAL stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_PLLSTB_CLR: PLL stabilization interrupt flag clear
      \arg        RCU_INT_FLAG_CKM_CLR: HXTAL clock monitor interrupt flag clear
    \param[out] none
    \retval     none
*/
void rcu_interrupt_flag_clear(rcu_int_flag_clear_enum int_flag)
{
    RCU_CCTL_REG_VAL(int_flag) |= BIT(RCU_BIT_POS(int_flag));
}

/*!
    \brief      enable the stabilization interrupt (API_ID(0x0055U))
    \param[in]  interrupt: clock stabilization interrupt, refer to rcu_int_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_LXTALSTB: LXTAL stabilization interrupt
      \arg        RCU_INT_HXTALSTB: HXTAL stabilization interrupt
      \arg        RCU_INT_PLLSTB: PLL stabilization interrupt
    \param[out] none
    \retval     none
*/
void rcu_interrupt_enable(rcu_int_enum interrupt)
{
    RCU_CCTL_REG_VAL(interrupt) |= BIT(RCU_BIT_POS(interrupt));
}

/*!
    \brief      disable the stabilization interrupt (API_ID(0x0056U))
    \param[in]  interrupt clock stabilization interrupt, refer to rcu_int_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_INT_LXTALSTB: LXTAL stabilization interrupt
      \arg        RCU_INT_HXTALSTB: HXTAL stabilization interrupt
      \arg        RCU_INT_PLLSTB: PLL stabilization interrupt
    \param[out] none
    \retval     none
*/
void rcu_interrupt_disable(rcu_int_enum interrupt)
{
    RCU_CCTL_REG_VAL(interrupt) &= ~BIT(RCU_BIT_POS(interrupt));
}

/*!    \brief      enable the RCTL triple modular redundancy error output (API_ID(0x0057U))
    \param[in]  rctl_tmr: RCTL triple modular redundancy error output enable
                only one parameter can be selected which is shown as below:
      \arg        RCU_TMRERRSTAT_TMR_RCU_SYSRSTSTATEN: RCU_SUBSERSTAT TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_RCU_SUBSRCTLEN: RCU_SUBSRCTL TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_RCU_SUBSRPACTLEN: RCU_SUBSRPACTL TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_RCU_SYSMRETHEN: RCU_SYSMRETH TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_RCU_ERPACFGEN: RCU_ERPACFG TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_AHBRSTEN: TMR_AHBRST TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_APBRSTEN: TMR_APBRST TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_PORWDG1EN: TMR_PORWDG1 TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_PORWDG2EN: TMR_PORWDG2 TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_PORWDG3EN: TMR_PORWDG3 TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_PORWDG4EN: TMR_PORWDG4 TMR error output enable
    \param[out] none
    \retval     none
*/
void rcu_rctl_tmr_enable(uint32_t rctl_tmr)
{
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_TMRERRSTAT_TMR_EN(rctl_tmr)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0057U), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_TMRERRSTAT |= rctl_tmr;
    }
}

/*! \brief      disable the RCTL triple modular redundancy error output (API_ID(0x0058U))
    \param[in]  rctl_tmr: RCTL triple modular redundancy error output disable
                only one parameter can be selected which is shown as below:
      \arg        RCU_TMRERRSTAT_TMR_RCU_SYSRSTSTATEN: RCU_SUBSERSTAT TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_RCU_SUBSRCTLEN: RCU_SUBSRCTL TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_RCU_SUBSRPACTLEN: RCU_SUBSRPACTL TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_RCU_SYSMRETHEN: RCU_SYSMRETH TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_RCU_ERPACFGEN: RCU_ERPACFG TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_AHBRSTEN: TMR_AHBRST TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_APBRSTEN: TMR_APBRST TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_PORWDG1EN: TMR_PORWDG1 TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_PORWDG2EN: TMR_PORWDG2 TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_PORWDG3EN: TMR_PORWDG3 TMR error output enable
      \arg        RCU_TMRERRSTAT_TMR_PORWDG4EN: TMR_PORWDG4 TMR error output enable
    \param[out] none
    \retval     none
*/
void rcu_rctl_tmr_disable(uint32_t rctl_tmr)
{
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_TMRERRSTAT_TMR_EN(rctl_tmr)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0058U), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_TMRERRSTAT &= ~rctl_tmr;
    }
}

/*! \brief      enable the CCTL triple modular redundancy error output (API_ID(0x0059U))
    \param[in]  cctl_tmr: CCTL triple modular redundancy error output enable
                only one parameter can be selected which is shown as below:
      \arg        RCU_BUSIM_TMR_TMR_EN0: TMR error 0 output to fmu enable
      \arg        RCU_BUSIM_TMR_TMR_EN1: TMR error 1 output to fmu enable
      \arg        RCU_BUSIM_TMR_TMR_EN2: TMR error 2 output to fmu enable
      \arg        RCU_BUSIM_TMR_TMR_EN3: TMR error 3 output to fmu enable
    \param[out] none
    \retval     none
*/
void rcu_cctl_tmr_enable(uint32_t cctl_tmr)
{
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_BUSIM_TMR_TMR_EN(cctl_tmr)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0059U), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_BUSIM_TMR |= cctl_tmr;
    }
}

/*!
    \brief      disable the CCTL triple modular redundancy error output (API_ID(0x005AU))
    \param[in]  cctl_tmr: CCTL triple modular redundancy error output disable
                only one parameter can be selected which is shown as below:
      \arg        RCU_BUSIM_TMR_TMR_EN0: TMR error 0 output to fmu enable
      \arg        RCU_BUSIM_TMR_TMR_EN1: TMR error 1 output to fmu enable
      \arg        RCU_BUSIM_TMR_TMR_EN2: TMR error 2 output to fmu enable
      \arg        RCU_BUSIM_TMR_TMR_EN3: TMR error 3 output to fmu enable
    \param[out] none
    \retval     none
*/
void rcu_cctl_tmr_disable(uint32_t cctl_tmr)
{
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_BUSIM_TMR_TMR_EN(cctl_tmr)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x005AU), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_BUSIM_TMR &= ~cctl_tmr;
    }
}

/*!
    \brief      get the RCTL TMR flags (API_ID(0x005BU))
    \param[in]  rctl_tmr_flag: RCTL TMR flags
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_RCU_SYSRSTSTAT: RCU_SYSRSTSTAT TMR error status
      \arg        RCU_FLAG_RCU_SUBSRCTL: RCU_SUBSRCTL TMR error status
      \arg        RCU_FLAG_RCU_SUBSRPACTL: RCU_SUBSRPACTL TMR error status
      \arg        RCU_FLAG_RCU_SYSMRETH: RCU_SYSMRETH TMR error status
      \arg        RCU_FLAG_RCU_ERPACFG: RCU_ERPACFG TMR error status
      \arg        RCU_FLAG_AHBRST: AHBRST TMR error status
      \arg        RCU_FLAG_APBRST: APBRST1/2 TMR error status
      \arg        RCU_FLAG_PORWDG1: PORWDG1 TMR error status
      \arg        RCU_FLAG_PORWDG2: PORWDG2 TMR error status
      \arg        RCU_FLAG_PORWDG3: PORWDG3 TMR error status
      \arg        RCU_FLAG_PORWDG4: PORWDG4 TMR error status
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_rctl_tmr_flag_get(uint32_t rctl_tmr_flag)
{
    FlagStatus flag = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_RCTL_TMR_FLAG(rctl_tmr_flag)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x005BU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the RCTL TMR flag */
        if(0U != (RCU_TMRERRSTAT & rctl_tmr_flag)) {
            flag = SET;
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
    }
    return flag;
}

/*!
    \brief      clear the RCTL TMR flags (API_ID(0x005CU))
    \param[in]  rctl_tmr_flag: RCTL TMR flags clear
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_RCU_SYSRSTSTAT: RCU_SYSRSTSTAT TMR error status
      \arg        RCU_FLAG_RCU_SUBSRCTL: RCU_SUBSRCTL TMR error status
      \arg        RCU_FLAG_RCU_SUBSRPACTL: RCU_SUBSRPACTL TMR error status
      \arg        RCU_FLAG_RCU_SYSMRETH: RCU_SYSMRETH TMR error status
      \arg        RCU_FLAG_RCU_ERPACFG: RCU_ERPACFG TMR error status
      \arg        RCU_FLAG_AHBRST: AHBRST TMR error status
      \arg        RCU_FLAG_APBRST: APBRST1/2 TMR error status
      \arg        RCU_FLAG_PORWDG1: PORWDG1 TMR error status
      \arg        RCU_FLAG_PORWDG2: PORWDG2 TMR error status
      \arg        RCU_FLAG_PORWDG3: PORWDG3 TMR error status
      \arg        RCU_FLAG_PORWDG4: PORWDG4 TMR error status
    \param[out] none
    \retval     none
*/
void rcu_rctl_tmr_flag_clear(uint32_t rctl_tmr_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_RCTL_TMR_FLAG(rctl_tmr_flag)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x005CU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_TMRERRSTAT |= rctl_tmr_flag;
    }
}

/*!
    \brief      get the CCTL TMR flags (API_ID(0x005DU))
    \param[in]  cctl_tmr_flag: CCTL TMR flags
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_ST0: System clock switching TMR error status
      \arg        RCU_FLAG_ST1: Clock enable TMR error status
      \arg        RCU_FLAG_ST2: Clock monitor enable register TMR error status
      \arg        RCU_FLAG_ST3: the TMR error occurs in any bit of TRIM register
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_cctl_tmr_flag_get(uint32_t cctl_tmr_flag)
{
    FlagStatus flag = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CCTL_TMR_FLAG(cctl_tmr_flag)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x005DU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* get the CCTL TMR flag */
        if(0U != (RCU_BUSIM_TMR & cctl_tmr_flag)) {
            flag = SET;
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
    }
    return flag;
}

/*!
    \brief      clear the CCTL TMR flags (API_ID(0x005EU))
    \param[in]  cctl_tmr_flag: CCTL TMR flags clear
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_ST0: System clock switching TMR error status
      \arg        RCU_FLAG_ST1: Clock enable TMR error status
      \arg        RCU_FLAG_ST2: Clock monitor enable register TMR error status
      \arg        RCU_FLAG_ST3: the TMR error occurs in any bit of TRIM register
    \param[out] none
    \retval     none
*/
void rcu_cctl_tmr_flag_clear(uint32_t cctl_tmr_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_CCTL_TMR_FLAG(cctl_tmr_flag)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x005EU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        RCU_BUSIM_TMR |= cctl_tmr_flag;
    }
}

/*!
    \brief      adjust the PLL loss of lock accuracy (API_ID(0x005FU))
    \param[in]  lol_accuracy: PLL loss of lock accuracy
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLLOL_UNLOCK_RANGE_1: (expected value(100) - 5) <= Unlock range <= (expected value(100) + 5)
      \arg        RCU_PLLLOL_UNLOCK_RANGE_2: (expected value(100) - 9) <= Unlock range <= (expected value(100) + 9)
      \arg        RCU_PLLLOL_UNLOCK_RANGE_3: (expected value(100) - 17) <= Unlock range <= (expected value(100) + 17)
      \arg        RCU_PLLLOL_UNLOCK_RANGE_4: (expected value(100) - 33) <= Unlock range <= (expected value(100) + 33)
    \param[out] none
    \retval     none
*/
void rcu_pll_loss_of_lock_config(uint32_t lol_accuracy)
{
    uint32_t reg;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_PLLLOL_UNLOCK_RANGE(lol_accuracy)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x005FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_PLLLOL;
        /* reset the RCU_PLLLOL_PLLLOLCTL bits and set according to lol_accuracy */
        reg &= ~RCU_PLLLOL_PLLLOLCTL;
        RCU_PLLLOL = (reg | (uint32_t)(lol_accuracy));
    }
}

/*!
    \brief      get the loss of lock detector flag (API_ID(0x0060U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_pll_loss_of_lock_flag_get(void)
{
    FlagStatus flag;
    /* get the loss of lock detector flag */
    if(0U != (RCU_PLLLOL & RCU_FLAG_PLLLOL)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      clear the loss of lock detector flag (API_ID(0x0061U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_pll_loss_of_lock_flag_clear(void)
{
    RCU_PLLLOL |= RCU_PLLLOL_PLLLOLFC;
}

/*!
    \brief      config fractional part of the multiplication factor for PLL VCO (API_ID(0x0062U))
    \param[in]  pll_fractional: fractional part of the multiplication factor,only one parameter can be selected
    \param[out] none
    \retval     none
*/
void rcu_pll_fractional_config(uint32_t pll_fractional)
{
    uint32_t reg;
    reg = RCU_PLLFRA;
    /* reset the RCU_PLLFRA_PLLFRACN bits and set according to pll_fractional */
    reg &= ~RCU_PLLFRA_PLLFRACN;
    RCU_PLLFRA = (reg | (uint32_t)(pll_fractional & 0x3FFFU));
}

/*!
    \brief      enable PLL fractional latch (API_ID(0x0063U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_pll_fractional_latch_enable(void)
{
    RCU_PLLFRA |= RCU_PLLFRA_PLLFRAEN;
}

/*!
    \brief      disable PLL fractional latch (API_ID(0x0064U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_pll_fractional_latch_disable(void)
{
    RCU_PLLFRA &= ~RCU_PLLFRA_PLLFRAEN;
}

