sorosaulong-ux/gd32-test-project/Library/gd32a7xx_rcu.c
/*!
    \brief    configure the spread spectrum modulation for the main PLL clock (API_ID(0x0065U))
    \param[in]  spread_spectrum_type: PLL spread spectrum modulation type select
                only one parameter can be selected which is shown as below:
      \arg        RCU_SS_TYPE_CENTER: center spread type is selected
      \arg        RCU_SS_TYPE_DOWN: down spread type is selected
    \param[in]  modstep: configure PLL spread spectrum modulation profile amplitude and frequency
                only one parameter can be selected which is shown as below:
      \arg        This parameter should be selected between 0 and 0x3FF.The following criteria must be met: MODSTEP*MODCNT <=2^14
    \param[in]  modcnt: configure PLL spread spectrum modulation profile amplitude and frequency
                only one parameter can be selected which is shown as below:
      \arg        This parameter should be selected between 0 and 0x7FF.The following criteria must be met: MODSTEP*MODCNT <=2^14
    \param[out] none
    \retval     none
*/
void rcu_spread_spectrum_config(uint32_t spread_spectrum_type, uint32_t modstep, uint32_t modcnt)
{
    uint32_t reg;
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_SS_TYPE(spread_spectrum_type)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0065U), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        reg = RCU_PLLSSCTL;
        /* reset the RCU_PLLSSCTL register bits */
        reg &= ~(RCU_PLLSSCTL_MODCNT | RCU_PLLSSCTL_MODSTEP | RCU_PLLSSCTL_SS_TYPE);
        RCU_PLLSSCTL = (reg | spread_spectrum_type | ((modstep & 0x3FFU) << 13U) | (modcnt & 0x7FFU));
    }
}

/*!
    \brief    disble the PLL spread spectrum modulation (API_ID(0x0066U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_spread_spectrum_disable(void)
{
    RCU_PLLSSCTL |= RCU_PLLSSCTL_SSCGBYP;
}

/*!
    \brief    enable the PLL spread spectrum modulation (API_ID(0x0067U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_spread_spectrum_enable(void)
{
    RCU_PLLSSCTL &= ~RCU_PLLSSCTL_SSCGBYP;
}

/*!
    \brief      config subsystem reset (API_ID(0x0068U))
    \param[in]  subsysrsrt: subsystem reset type
                one or more parameter can be selected which is shown as below:
      \arg        RCU_SUBSRCTL_FMU_RST_RD: subsystem reset FMU_RST
      \arg        RCU_SUBSRCTL_FWDGT0_RST_RD: subsystem reset FWDGT0_RST
      \arg        RCU_SUBSRCTL_FWDGT1_RST_RD: subsystem reset FWDGT1_RST (not for GD32A711X_A712X)
      \arg        RCU_SUBSRCTL_WWDGT0_RST_RD: subsystem reset WWDGT0_RST
      \arg        RCU_SUBSRCTL_WWDGT1_RST_RD: subsystem reset WWDGT1_RST (not for GD32A711X_A712X)
      \arg        RCU_SUBSRCTL_DBG_RST_RD: subsystem reset DBG_RST
      \arg        RCU_SUBSRCTL_OBL_RST_RD: subsystem reset OBL_RST (not for GD32A711X_A712X)
    \param[in]  reset_config: trigger a reset or trigger an interrupt.
                only one parameter can be selected which is shown as below:
      \arg        DISABLE: trigger a reset
      \arg        ENABLE: trigger an interrupt
    \param[out] none
    \retval     none
    \note       this register can be written to only once after a system reset or POR reset and this register is
                reset only on POR reset and any system reset.
*/
void rcu_subsystem_reset_config(uint32_t subsysrsrt, ControlStatus reset_config)
{    
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_CTL_STATUS(reset_config)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0068U), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        if(reset_config == DISABLE) {
            RCU_SUBSRCTL &= ~subsysrsrt;
        } else {
            RCU_SUBSRCTL |= subsysrsrt;
        }
    }
}

/*!
    \brief      config subsystem reset pin assertion (API_ID(0x0069U))
    \param[in]  subsysrsrt: subsystem reset type
                only one parameter can be selected which is shown as below:
      \arg        RCU_SUBSRPACTL_ST_FINISH_RPAEN: Reset pin assert enable for subsystem reset ST_FINISH
    \param[in]  reset_pin_assert: External reset pin assertion control
                only one parameter can be selected which is shown as below:
      \arg        DISABLE: do not assert the external reset pin
      \arg        ENABLE: assert the external reset pin
    \param[out] none
    \retval     none
*/
void rcu_subsystem_reset_pin_assertion_config(uint32_t subsysrsrt, ControlStatus reset_pin_assert)
{
    #ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_RCU_SUBSRPACTL_RPAEN(subsysrsrt)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0069U), ERR_PARAM_INVALID);   
    } else if(NOT_CTL_STATUS(reset_pin_assert)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0069U), ERR_PARAM_INVALID);
    } else
    #endif /* FW_DEBUG_ERR_REPORT */
    {
        if(reset_pin_assert == DISABLE) {
            RCU_SUBSRPACTL &= ~subsysrsrt;
        } else {
            RCU_SUBSRPACTL |= subsysrsrt;
        }
    }
}
